<?php
$Lang = array(

"main" => "Главная",
//////////////////////////////////////////////////////////////////Меню
"first" => "Are you ready?",
"lections" => "Лекции",
"second" => "Prepare",
"CN" => "Компьютерные науки",
"AM" => "Прикладная математика",
"galery" => "Галерея",
"third" => "Your",
"contacts" => "Контакты",
"fourth" => "Mind",
"sign" => "Вход",
"register" => "Регистрация",
"fifth" => "Присоединяйся",
//////////////////////////////////////////////////////////////////Футер
"footer" => "© 2017 г.",
//////////////////////////////////////////////////////////////////Регистрация
"regForm" => "Форма регистрации",
"nullPercent" => "0%",
"personalData" => "Персональные данные",
"FIO" => "ФИО:",
"mail" => "Email:",
"pass" => "Пароль:",
"passAccept" => "Подтвердите пароль:",
"socialData" => "Социальные данные",
"vk" => "VK:",
"insta" => "Instagram:",
"bio" => "Bio:",
"regEnd" => "Завершение регистрации",
"thx" => "Спасибо за регистрацию!",
"nextB" => "Далее",
"backB" => "Назад",
"regButton"=>"Регистрация",
"signButton"=>"Войти",
"signForm"=>"Пожалуйста, введите email и пароль",
//////////////////////////////////////////////////////////////////
"" => "",
"" => "",
"" => "",
"" => "",
"" => "",
"" => "",
 );
?>