<?php
$Lang = array(

"main" => "Головна",
//////////////////////////////////////////////////////////////////Меню
"first" => "Are you ready?",
"lections" => "Лекції",
"second" => "Prepare",
"CN" => "Комп'ютерні науки",
"AM" => "Прикладна математика",
"galery" => "Галерея",
"third" => "Your",
"contacts" => "Контакти",
"fourth" => "Mind",
"sign" => "Вхід",
"register" => "Реєстрація",
"fifth" => "Приєднуйся",
"signout" => "Exit",
//////////////////////////////////////////////////////////////
"lm1" => "Лекційні курси",
"lm2" => "Поринь у світ комп'ютерних наук.",
"lm3" => "Поринь у світ прикладної математики",
"ll1" => "З чого складаються та що вивчають комп’ютерні науки.",
"ll2" => "Що таке інформаційні технології?",
"ll3" => "Путь комп'ютерних наук - від перших обчислювальних машин до всебічної інформатизації сьогодні.",
"ll4" => "Чим займаються IT-спеціалісти?",
"ll5" => "Що таке програмування?",
"ll6" => "Висновки",
////////////////////////////////////////////////////////////////Галерея
"gallery" => "Галерея",
"g1" => "Галерея кафедри КМПС",
"g2" => "День І факультету",
"g3" => "День І факультету у 2016-му році",
"g4" => "",
"g5" => "",
"g6" => "",
//////////////////////////////////////////////////////////////////Футер
"footer" => "© 2017 р.",
//////////////////////////////////////////////////////////////////Регистрация
"regForm" => "Форма реєстрації",
"nullPercent" => "0%",
"personalData" => "Персональні дані",
"FIO" => "ПІБ:",
"mail" => "Email:",
"pass" => "Пароль:",
"passAccept" => "Підтвердити пароль:",
"socialData" => "Соціальні дані",
"vk" => "VK:",
"insta" => "Instagram:",
"bio" => "Bio:",
"regEnd" => "Закінчення реєстрації",
"thx" => "Дякуємо за реєстрацію!",
"nextB" => "Далі",
"backB" => "Назад",
"regButton"=>"Реєстрація",
"signButton"=>"Вхід",
"signForm"=>"Будь ласка, введіть email та пароль",
"signout" => "Вихід",
"test" => "Тест",
//////////////////////////////////////////////////////////////////Лекции
"btn" => "Тест буде доступний через: ",
/////////////////////////////////////////////Вступление
"i0" => "Вступ",
"i1" => "Шановний колего!",
"i2" => "Вважаємо,",
"i3" => "<SPAN>
що ми можемо звертатись таким чином до
наших відвідувачів, до тих, хто цікавиться
усім, що пов’язано зі світом комп’ютерів
та їхнього програмування. 
</SPAN>",
"i4" => "<SPAN>Вашій увазі пропонується
</SPAN></FONT><FONT SIZE=4><SPAN><B>дистанційний
курс</B></SPAN></FONT><FONT SIZE=4><SPAN>,
присвячений вступу до спеціальності
</SPAN></FONT><FONT SIZE=4><SPAN><B>«Комп’ютерні
науки та інформаційні технології»</B></SPAN></FONT><FONT SIZE=4><SPAN>.
З нього ви дізнаєтесь про те, як шляхом
взаємодії математиків та інженерів за
останні десятиріччя вдалося створити
саме цей напрямок, про його основні,існуючі
деякий час, та новітні, тільки-но створені,
складові, про те, чим займаються фахівці
ІТ- галузі, як створюються програми для
комп’ютерів тощо. </SPAN>",
"i5" => "<FONT SIZE=4><SPAN>Зрозуміло, що цей
невеликий курс </SPAN></FONT><FONT SIZE=4><SPAN><B>дистанційного
спілкування</B></SPAN></FONT><FONT SIZE=4><SPAN>
побудовано на засадах та підходах
науково-популярної літератури. Інакше
й не можливо, бо ми сподіваємось, що він
буде цікавим та корисним насамперед
</SPAN></FONT><FONT SIZE=4><SPAN><B>старшокласникам,</B></SPAN></FONT><FONT SIZE=4><SPAN>
що цікавляться усім тим, що пов’язано
з сучасними комп’ютерами та програмами.
Корисним буде курс й студентам першого
курсу, а також усім, хто має намір
підвищити свій рівень знань у ІТ сфері,
яка сьогодні торкається справ практично
кожної людини. </SPAN></FONT>",
"i6" => "<FONT SIZE=4><SPAN>Опанування курсу
надасть користувачу можливість лише
доторкнутись до загальних основ та
складових частин </SPAN></FONT><FONT SIZE=4><SPAN><I><B>спеціальності</B></I></SPAN></FONT><FONT SIZE=4><SPAN>.
Її справжнє вивчення є можливим лише у
рамках університетської освіти, де
базові курси з математичних дисциплін
стають основою для побудови алгоритмів
та програмного забезпечення, а практичні
потреби, наприклад, створення нових
алгоритмічних мов та відповідних
трансляторів, обумовлюють розвиток
спеціальних розділів математики та
кібернетики. </SPAN></FONT>",
"i7" => "<FONT SIZE=4><SPAN>Як й будь-яка нова
галузь знань, комп’ютерні науки стрімко
розвиваються. До того ж, цей розвиток
обумовлюється бурхливим зростанням
застосувань комп’ютерів у широкому
сенсі – десктопів, ноутбуків, планшетів,
смартфонів тощо, програм до них, у різних
сферах людської діяльності. Це обумовлює
постійне додавання нових розділів до
спеціальності, методів та технологій
розв’язання задач, що створює майже
нескінчене поле діяльності для теперішніх
та майбутніх фахівців. </SPAN></FONT>",
"i8" => "<FONT SIZE=4><SPAN>Курс розроблено
викладачами кафедри комп’ютерного
моделювання процесів та систем
Національного технічного університету
«Харківський політехнічний інститут».
При цьому використано їхній досвід
практичної роботи у проектуванні,
розробці та тестуванні алгоритмів та
комп’ютерних програм й обчислювальних
систем. </SPAN></FONT>",
"i9" => "<FONT SIZE=4><SPAN>Сподіваємось, що
вивчення курсу, що пропонується вашій
увазі, допоможе старшокласникам зробити
свій вибір та обрати навчання на
спеціальності «Комп’ютерні науки та
інформаційні технології» зі спеціалізацією
«Проектування, розробка та аналіз
комп’ютерних систем»(посилання)на
кафедрі комп’ютерного моделювання
процесів та систем НТУ «ХПІ». Для того,
щоб більш детально ознайомитись з
програмою навчання, спільними розробками
студентів та науковців, рекомендуємо
відвідати сайт кафедри (посилання). </SPAN></FONT>",
"i10" => "<FONT SIZE=4><SPAN><I><B>Чекаємо на вас на
першому курсі у вересні 2017 року!</B></I></SPAN></FONT>",

//////////////////////////////////////////////////////////////////////Лекция 1
"l10" => "Лекція №1",
"l11" => "<SPAN>Лекція 1.<BR>З чого складаються
та що вивчають комп’ютерні науки.</SPAN>",
"l12" => "<FONT SIZE=4><SPAN><B>Комп’ютерні науки</B></SPAN></FONT><FONT SIZE=4><SPAN>
	дуже широке поняття, вони вивчають усе
	що пов’язане з комп’ютером та його
	системою, тож ми розглянемо декілька
	найцікавіших пунктів. </SPAN></FONT>",
"l13" => "<FONT SIZE=4><SPAN><I>Спочатку розглянемо
	історію. </I></SPAN></FONT>",
"l14" => "<FONT SIZE=4><SPAN>Ускладнення сучасного
	промислового виробництва, необхідність
	оперативного зв’язку між різноманітними
	підприємствами, потреба в опрацюванні
	за короткий час величезної кількості
	інформаціі поставили на порядок денний
	питання автоматизації багатьох функцій
	управління </SPAN></FONT><FONT SIZE=4><SPAN><I>різними
	галузями виробництва, науки, освіти.</I></SPAN></FONT><FONT SIZE=4><SPAN>
	Для ефективного управління досить
	складною системою, наприклад підприємством
	чи галуззю виробництва, потрібно в
	стислі строки обробляти величезні
	потоки інформації. </SPAN></FONT>",
"l15" => "<FONT SIZE=4><SPAN>Об’єктивна можливість
	такого управління з’явилась лише
	завдяки досягненням математики,
	кібернетики, теорії інформації, а також
	розвитку електронно - обчислювальної
	техніки. Про це більш детально у лекції
	№3. </SPAN></FONT>",
"l16" => "<FONT SIZE=4><SPAN>Слово “</SPAN></FONT><FONT SIZE=4><SPAN><B>кібернетика”</B></SPAN></FONT><FONT SIZE=4><SPAN>
	(</SPAN></FONT><FONT SIZE=4><SPAN><I>гр. ”мистецтво
	керманича”</I></SPAN></FONT><FONT SIZE=4><SPAN>)
	вперше вжив як термін для управління
	в загальному розумінні давньогрецький
	філософ Платон. Видатний французький
	вчений Ампер запропонував називати
	кібернетикою науку про управління
	людським суспільством. </SPAN></FONT>",
"l17" => "<FONT SIZE=4><SPAN>Кібернетика як наука
	виникла лише в </SPAN></FONT><FONT SIZE=4><SPAN><B>40-х</B></SPAN></FONT><FONT SIZE=4><SPAN>
	роках нашого століття. У </SPAN></FONT><FONT SIZE=4><SPAN><B>1948</B></SPAN></FONT><FONT SIZE=4><SPAN>
	році з’явилася перша праця, присвячена
	питанням кібернетики - “Кібернетика,
	або управління і зв’язок у тварині і
	машині”. Автор її - відомий американський
	учений </SPAN></FONT><FONT SIZE=4><SPAN><B>Норберт
	Вінер</B></SPAN></FONT><FONT SIZE=4><SPAN>. </SPAN></FONT>",
"l18" => "<FONT SIZE=4><SPAN>Процес управління з
	погляду </SPAN></FONT><FONT SIZE=4><SPAN><B>кібернетики</B></SPAN></FONT><FONT SIZE=4><SPAN>
	є процес </SPAN></FONT><FONT SIZE=4><SPAN><I>збирання,
	опрацювання</I></SPAN></FONT><FONT SIZE=4><SPAN>
	інформації та </SPAN></FONT><FONT SIZE=4><SPAN><I>видачі</I></SPAN></FONT><FONT SIZE=4><SPAN>
	результатів такого опрацювання у
	вигляді нової інформації </SPAN></FONT><FONT SIZE=4><SPAN><I>(вказівок,
	інструкцій, рекомендацій, результатів
	аналізу вхідної інформації). </I></SPAN></FONT>",
"l19" => "<FONT SIZE=4><SPAN>Ефективне і якісне
	управління складними динамічними
	системами в наш час немислиме без
	застосування швидкодіючих
	електронно-обчислювальних машин </SPAN></FONT><FONT SIZE=4><SPAN><B>(ЕОМ)</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	</SPAN></FONT>",
"l110" => "<FONT SIZE=4><SPAN>З давніх часів люди
	створювали все можливі механізми і
	машини для полегшення своєї праці.
	Однак до недавнього часу машини
	полегшували лише фізичну працю людини.
	Діяльність, пов’язана з розумовою
	працею, обходилась без серйозної участі
	машин. </SPAN></FONT>",
"l111" => "<FONT SIZE=4><SPAN>Створення швидкодіючих
	</SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	справедливо вважається одним із видатних
	науково-технічних досягнень людства.
	Сучасні </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	здатні виконати за секунду мільйони
	арифметичних операцій, в той час як
	досвідчений обчислювач тратить на
	виконання однієї дії в середньому
	півхвилини. Таким чином, з появою </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	за короткий проміжок часу (біля </SPAN></FONT><FONT SIZE=4><SPAN><B>35
	років</B></SPAN></FONT><FONT SIZE=4><SPAN>)
	швидкість обчислень зросла приблизно
	</SPAN></FONT><FONT SIZE=4><SPAN><B>в 100 млн.
	разів.</B></SPAN></FONT>",
"l112" => "<FONT SIZE=4><SPAN>Приклад. Англійський
	математик </SPAN></FONT><FONT SIZE=4><SPAN><B>ХІХ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	віку </SPAN></FONT><FONT SIZE=4><SPAN><I>Вільям
	Шенкс</I></SPAN></FONT><FONT SIZE=4><SPAN>
	витратив більше </SPAN></FONT><FONT SIZE=4><SPAN><B>20</B></SPAN></FONT><FONT SIZE=4><SPAN>
	років життя на обчислення числа </SPAN></FONT><FONT SIZE=4><SPAN><I>p</I></SPAN></FONT><FONT SIZE=4><SPAN>
	з точністю </SPAN></FONT><FONT SIZE=4><SPAN><B>707</B></SPAN></FONT><FONT SIZE=4><SPAN>
	значущих цифр. Цей результат - рекорд
	обчислень </SPAN></FONT><FONT SIZE=4><SPAN><B>ХІХ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	століття. Однак виявилось, що Шенкс
	помилився на </SPAN></FONT><FONT SIZE=4><SPAN><B>520</B></SPAN></FONT><FONT SIZE=4><SPAN>
	знаці. </SPAN></FONT><FONT SIZE=4><SPAN><B>(1853-1873рр.)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	ці числа за його проханням були зображені
	на могильній плиті. </SPAN></FONT>",
"l113" => "<FONT SIZE=4><SPAN><B>1981 рік</B></SPAN></FONT><FONT SIZE=4><SPAN>
	- учень </SPAN></FONT><FONT SIZE=4><SPAN><B>9
	класу</B></SPAN></FONT><FONT SIZE=4><SPAN><I>м.
	Арзамас</I></SPAN></FONT><FONT SIZE=4><SPAN><B>С.Баталов</B></SPAN></FONT><FONT SIZE=4><SPAN>
	обчислив більше </SPAN></FONT><FONT SIZE=4><SPAN><B>50
	тисяч</B></SPAN></FONT><FONT SIZE=4><SPAN> знаків
	за годину (</SPAN></FONT><FONT SIZE=4><SPAN><B>БЕСМ
	- 6 </B></SPAN></FONT><FONT SIZE=4><SPAN>- </SPAN></FONT><FONT SIZE=4><SPAN><U>більше
	мільйона операцій в секунду</U></SPAN></FONT><FONT SIZE=4><SPAN>).
	Шенку потрібно було б не менше 200 тисяч
	років. </SPAN></FONT>",
"l114" => "<FONT SIZE=4><SPAN>Вже найперші
	обчислювальні машини </SPAN></FONT><FONT SIZE=4><SPAN><B>(25
	грудня 1951 року - вступила в дію МЕСМ -
	перша в СРСР ЕОМ - С.О. Лєбєдєв)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	одержали </SPAN></FONT><FONT SIZE=4><SPAN><B>2
	тис.</B></SPAN></FONT><FONT SIZE=4><SPAN> знаків
	</SPAN></FONT><FONT SIZE=4><SPAN><I>p</I></SPAN></FONT><FONT SIZE=4><SPAN>.
	В </SPAN></FONT><FONT SIZE=4><SPAN><B>1961 році</B></SPAN></FONT><FONT SIZE=4><SPAN>
	- </SPAN></FONT><FONT SIZE=4><SPAN><B>100 тисяч</B></SPAN></FONT><FONT SIZE=4><SPAN>
	знаків (за </SPAN></FONT><FONT SIZE=4><SPAN><B>9
	годин</B></SPAN></FONT><FONT SIZE=4><SPAN>).
	Сьогодні відомо </SPAN></FONT><FONT SIZE=4><SPAN><U>більше
	півмільйона</U></SPAN></FONT><FONT SIZE=4><SPAN>
	знаків числа </SPAN></FONT><FONT SIZE=4><SPAN><I>p</I></SPAN></FONT><FONT SIZE=4><SPAN>.
	</SPAN></FONT>",
"l115" => "<FONT SIZE=4><SPAN>Отже, </SPAN></FONT><FONT SIZE=4><SPAN><B>обчислювальні
	машини</B></SPAN></FONT><FONT SIZE=4><SPAN>
	здатні дуже швидко і точно виконувати
	арифметичні розрахунки. Але це вміння
	- не єдине і навіть не головне. Завдяки
	</SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	відбувається інтенсивний процес
	математизації не лише природних і
	технічних, а й суспільних наук, математичні
	моделі широко використовуються в </SPAN></FONT><FONT SIZE=4><SPAN><I>хімії,
	біології, медицині, економіці, психології,
	лінгвістиці. </I></SPAN></FONT>",
"l116" => "<SPAN>Еволюція мов програмування</SPAN>",
"l117" => "<FONT SIZE=4><SPAN>Розвиток </SPAN></FONT><FONT SIZE=4><SPAN><B>обчислювальної
	техніки</B></SPAN></FONT><FONT SIZE=4><SPAN>
	супроводжується створенням нових і
	вдосконаленням існуючих </SPAN></FONT><FONT SIZE=4><SPAN><B>мов
	програмування </B></SPAN></FONT><FONT SIZE=4><SPAN><I><U><B>(МП)</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN>
	— засобів спілкування </SPAN></FONT><FONT SIZE=4><SPAN><B>програмістів</B></SPAN></FONT><FONT SIZE=4><SPAN>
	з </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Під ЯП розуміють правила подання даних
	і запису алгоритмів їх обробки, що
	автоматично виконуються ЕОМ. </SPAN></FONT><FONT SIZE=4><SPAN><I>У
	більш абстрактному вигляді ЯП є засобом
	створення програмних моделей об’єктів
	і явищ зовнішнього світу. </I></SPAN></FONT><FONT SIZE=4><SPAN>На
	сьогодні вже створено </SPAN></FONT><FONT SIZE=4><SPAN><I><B>десятки</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	різних ЯП (як примітивних, так і близьких
	до мови людини). Щоб розібратися в
	розмаїтті МП, потрібно знати їх
	класифікацію, а також історію створення,
	еволюцію і тенденції розвитку. Рушійні
	сили еволюції ЯП Щоб розуміти тенденції
	розвитку </SPAN></FONT><FONT SIZE=4><SPAN><B>МП</B></SPAN></FONT><FONT SIZE=4><SPAN>,
	потрібно знати рушійні сили їх еволюції.
	Для з’ясування цього питання будемо
	розглядати ЯП з різних точок зору. </SPAN></FONT>",
"l118" => "<FONT SIZE=4><SPAN><I><U><B>По-перше,</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN><B>МП</B></SPAN></FONT><FONT SIZE=4><SPAN>
	є інструментом програміста для створення
	програм. Для створення якісних програм
	потрібні зручні </SPAN></FONT><FONT SIZE=4><SPAN><B>МП.
	</B></SPAN></FONT><FONT SIZE=4><SPAN>Тому однією
	з рушійних сил еволюції ЯП є прагнення
	розробників до створення більш досконалих
	програм. </SPAN></FONT>",
"l119" => "<FONT SIZE=4><SPAN><I><U><B>По-друге,</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN>
	процес розроблення програми можна
	порівнювати з промисловим виробництвом,
	в якому визначальними чинниками є
	продуктивність праці колективу
	програмістів, собівартість і якість
	програмної продукції. Створюються
	різноманітні технології розроблення
	програм (структурне, модульне,
	об’єктно-орієнтоване програмування
	та ін. ), що повинні підтримуватися </SPAN></FONT><FONT SIZE=4><SPAN><B>МП.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Тому другою рушійною силою еволюції
	ЯП є прагнення до підвищення ефективності
	процесу виробництва програмної
	продукції. </SPAN></FONT>",
"l120" => "<FONT SIZE=4><SPAN><I><U><B>По-третє,</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN>
	програми можна розглядати як аналог
	електронних приладів обробки інформації,
	в яких замість радіодеталей і мікросхем
	використовують конструкції ЯП (елементна
	база програми). Як і електронні прилади,
	програми можуть бути найпростішими
	(рівня детекторного приймальника) і
	дуже складними (рівня автоматичної
	космічної станції), при цьому рівень
	інструменту повинен відповідати
	складності виробу. Крім того, людині
	зручніше описувати об’єкт, що моделюється,
	використовуючи терміни предметної
	галузі, а не мовою цифр. Тому третьою
	рушійною силою, що веде до створення
	нових, спеціалізованих, орієнтованих
	на проблемну галузь, потужних </SPAN></FONT><FONT SIZE=4><SPAN><B>МП,
	</B></SPAN></FONT><FONT SIZE=4><SPAN>є збільшення
	різноманітності і підвищення складності
	задач, які розв’язуються за допомогою
	</SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ. </B></SPAN></FONT>",
"l121" => "<FONT SIZE=4><SPAN><I><U><B>По-четверте,</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN>
	вдосконалення самих </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	призводить до необхідності створення
	мов, що максимально реалізують нові
	можливості </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ.
	</B></SPAN></FONT>",
"l122" => "<FONT SIZE=4><SPAN><I><U><B>По-п’яте,</B></U></I></SPAN></FONT><FONT SIZE=4><SPAN>
	програми є інтелектуальним продуктом,
	який потрібно накопичувати і примножувати.
	Але програми, як і технічні вироби,
	мають властивість морального старіння,
	однією з причин якого є їх залежність
	від типу </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	і операційного середовища. З моральним
	старінням програм борються шляхом їх
	модернізації і випуску нових версій,
	проте в умовах частої зміни типів </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	і операційних середовищ розробники
	будуть тільки тим і займатися, що
	модернізувати старі програми. Мова
	програмування повинна забезпечувати
	тривалий життєвий цикл програми.
	Прагнення до цього є п’ятою рушійною
	силою розвитку </SPAN></FONT><FONT SIZE=4><SPAN><B>МП.</B></SPAN></FONT>",
"l123" => "<SPAN>Історія розвитку МП.</SPAN>",
"l124" => "<FONT SIZE=4><SPAN>Відомо, що першим
	програмістом була </SPAN></FONT><FONT SIZE=4><SPAN><B>жінка—леді
	Ада Лавлейс</B></SPAN></FONT><FONT SIZE=4><SPAN>,
	дочка лорда </SPAN></FONT><FONT SIZE=4><SPAN><B>Байрона</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Вона розробляла програми для одного з
	перших механічних комп’ютерів,
	створеного на початку минулого століття
	англійським ученим </SPAN></FONT><FONT SIZE=4><SPAN><B>Чарльзом
	Беббіджом</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Однак програмування в сучасному
	розумінні почалося з моменту створення
	першої </SPAN></FONT><FONT SIZE=4><SPAN><B>електронної
	обчислювальної машини.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Але незважаючи на це, ім’я цієї видатної
	жінки—Ada—присвоєно одній з найпотужніших
	сучасних МП, що є базовою для Міністерства
	оборони </SPAN></FONT><FONT SIZE=4><SPAN><I>США.</I></SPAN></FONT><FONT SIZE=4><SPAN><I><B>Перші
	ЕОМ,</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	створені людиною, мали невеликий набір
	команд і вбудованих типів даних, але
	дозволяли виконувати програми на
	машинній мові. </SPAN></FONT><FONT SIZE=4><SPAN><B>Машинна
	мова (ММ</B></SPAN></FONT><FONT SIZE=4><SPAN>)—
	єдина мова, яку розуміє </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Вона реалізується апаратно: кожну
	команду виконує певний електронний
	пристрій. Програма на ММ являє собою
	послідовність команд і даних, заданих
	у цифровому вигляді. </SPAN></FONT><FONT SIZE=4><SPAN><I>Наприклад,</I></SPAN></FONT><FONT SIZE=4><SPAN>
	команда вигляду </SPAN></FONT><FONT SIZE=4><SPAN><B>1А12</B></SPAN></FONT><FONT SIZE=4><SPAN>
	або </SPAN></FONT><FONT SIZE=4><SPAN><B>0001101000010010</B></SPAN></FONT><FONT SIZE=4><SPAN>
	означає операцію додавання </SPAN></FONT><FONT SIZE=4><SPAN><B>(1А)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	вмісту регістрів </SPAN></FONT><FONT SIZE=4><SPAN><B>1</B></SPAN></FONT><FONT SIZE=4><SPAN>
	і </SPAN></FONT><FONT SIZE=4><SPAN><B>2.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Машинною мовою дані представляються
	числами і символами. Операції є
	елементарними і з них будується вся
	програма. Введення програми в цифровому
	вигляді виконувалося безпосередньо в
	пам’ять з пульту </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	або з примітивних пристроїв введення.
	Природно, що процес програмування був
	дуже трудомістким, розібратися в
	програмі навіть автору було досить
	складно, а ефект від застосування ЕОМ
	був незначним. Цей етап в розвитку ЯП
	показав, що програмування є складною
	проблемою, що важко піддається
	автоматизації, а саме програмне
	забезпечення визначає ефективність
	застосування </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ.
	</B></SPAN></FONT><FONT SIZE=4><SPAN>Тому на всіх
	наступних етапах зусилля спрямовувалися
	на вдосконалення інтерфейсу між
	програмістом і </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ
	</B></SPAN></FONT><FONT SIZE=4><SPAN>— мови
	програмування. Прагнення програмістів
	оперувати не цифрами, а символами,
	призвело до створення мнемонічної мови
	програмування, що називають асемблером,
	мнемокодом, автокодом. Ця мова має
	певний синтаксис запису програм, в
	якому зокрема цифровий код операції
	замінений мнемонічним кодом. Наприклад,
	команда додавання записується у вигляді
	</SPAN></FONT><FONT SIZE=4><SPAN><B>AR 1,2</B></SPAN></FONT><FONT SIZE=4><SPAN>
	й означає додавання </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(Addition)</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	типу регістр-регістр </SPAN></FONT><FONT SIZE=4><SPAN><B>(Register)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	для регістрів </SPAN></FONT><FONT SIZE=4><SPAN><B>1</B></SPAN></FONT><FONT SIZE=4><SPAN>
	і </SPAN></FONT><FONT SIZE=4><SPAN><B>2. </B></SPAN></FONT><FONT SIZE=4><SPAN>Тепер
	програма має зручнішу для читання
	форму, але її не розуміє ЕОМ. Тому
	потрібно було ще створити спеціальну
	програму-транслятор, що перетворює
	програму з мови асемблера на </SPAN></FONT><FONT SIZE=4><SPAN><B>ММ.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Ця проблема вимагала, в свою чергу,
	глибоких наукових досліджень і
	розроблення різноманітних теорій,
	наприклад, теорії формальних мов, що
	лягли в основу створення трансляторів.
	Практично будь-який клас ЕОМ має свою
	мову асемблера. Тепер мова асемблера
	використовується для створення системних
	програм, що використовують специфічні
	апаратні можливості цього класу </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ.</B></SPAN></FONT>",
"l125" => "<FONT SIZE=4><SPAN>Наступний етап
	характеризується створенням мов
	високого рівня </SPAN></FONT><FONT SIZE=4><SPAN><B>(ЯВР).</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Ці мови є </SPAN></FONT><FONT SIZE=4><SPAN><I><B>універсальними</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	(дають змогу створювати будь-які
	прикладні програми) й алгоритмічно
	повними, мають більш широкий спектр
	типів даних і операцій, підтримують
	технології програмування. Цими мовами
	створюється безліч різноманітних
	прикладних програм. Принциповими
	відмінностями </SPAN></FONT><FONT SIZE=4><SPAN><I><B>ЯВР</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	від мов низького рівня є використання
	змінних, можливість запису складних
	виразів;можливість розширення набору
	типів даних за рахунок конструювання
	нових типів з базових; можливість
	розширення набору операцій за рахунок
	підключення бібліотек підпрограм;низька
	залежність від типу </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	З ускладненням ЯП модернізуються й
	транслятори для них. Тепер у набір
	інструментів програміста, окрім
	транслятора, входить текстовий редактор
	для введення тексту програм, налагоджувач
	для усунення помилок, бібліотекар для
	створення бібліотек програмних модулів
	і багато інших службових програм. Усе
	це разом називається системою
	програмування. </SPAN></FONT>",
"l126" => "<FONT SIZE=4><SPAN>Найбільш яскравими
	представниками </SPAN></FONT><FONT SIZE=4><SPAN><I><B>ЯВР
	є FORTRAN, PL/1, Pascal, C, Basic, Ada. </B></I></SPAN></FONT><FONT SIZE=4><SPAN>Може
	виникнути питання: чому створено стільки
	різноманітних мов одного класу? Чому
	не можна створити одну мову, яка
	відповідала б усім вимогам? Відповідь
	може бути такою, як і на питання про
	різноманітні мови народів світу: так
	вийшло. Кожен з розробників </SPAN></FONT><FONT SIZE=4><SPAN><B>ЯВР</B></SPAN></FONT><FONT SIZE=4><SPAN>
	прагнув створити найкращу і
	найуніверсальнішу мову, що давала б
	змогу швидко одержувати найефективніші,
	надійні і безпомилкові програми. Однак
	в процесі цього пошуку з’ясувалося,
	що результат залежить не від самої
	мови, а від технології її використання.
	Тому подальший розвиток мов став
	визначатися новими технологіями
	програмування. Водночас з розвитком
	універсальних </SPAN></FONT><FONT SIZE=4><SPAN><B>ЯВР</B></SPAN></FONT><FONT SIZE=4><SPAN>
	стали розвиватися проблемно-орієнтовні
	МП, що вирішували економічні задачі
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>(COBOL), </B></I></SPAN></FONT><FONT SIZE=4><SPAN>задачі
	реального часу </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(Modula-2,
	Ada),</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	символьної обробки </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(Snobol),</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	моделювання </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(GPSS,
	Simula, SmallTalk),</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	чисельно-аналітичні задачі </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(Аналітик)</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	та ін. Ці спеціалізовані мови давали
	змогу адекватніше описувати об’єкти
	і явища реального світу, наближаючи
	мови програмування до мови фахівця в
	проблемній галузі. </SPAN></FONT>",
"l127" => "<FONT SIZE=4><SPAN>Особливо слід відзначити
	мову </SPAN></FONT><FONT SIZE=4><SPAN><B>Аналітик,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	яка була розроблена Київським інститутом
	кібернетики для вітчизняної </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ
	“Мир-2”. </B></SPAN></FONT><FONT SIZE=4><SPAN>Крім
	звичайних засобів </SPAN></FONT><FONT SIZE=4><SPAN><B>ЯВР,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	ця мова використовувала загальну
	математичну символіку, виконувала
	диференціювання, інтегрування та
	спрощення виразів. Іншим напрямом
	розвитку ЯП є створення мов надвисокого
	рівня </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(МНВР).
	</B></I></SPAN></FONT><FONT SIZE=4><SPAN>Мовою
	високого рівня програміст задає
	процедуру (алгоритм) одержання результату
	на основі відомих вихідних даних, тому
	вони називаються процедурними </SPAN></FONT><FONT SIZE=4><SPAN><B>МП.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	На </SPAN></FONT><FONT SIZE=4><SPAN><B>МНВР</B></SPAN></FONT><FONT SIZE=4><SPAN>
	програміст задає відношення між
	об’єктами в програмі, наприклад, систему
	лінійних рівнянь, і визначає, що потрібно
	знайти, але не вказує як отримати
	результат. Такі мови називають також
	непроцедурними, оскільки сама процедура
	пошуку розв’язку вбудована в мову </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(в
	її інтерпретатор).</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	Вони використовуються, </SPAN></FONT><FONT SIZE=4><SPAN><B>наприклад,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	для розв’язування задач штучного
	інтелекту </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(Lisp,
	Prolog)</B></I></SPAN></FONT><FONT SIZE=4><SPAN> і
	дають змогу моделювати розумову
	діяльність людини в процесі пошуку
	розв’язків. До непроцедурних мов можна
	віднести і мови запитів систем управління
	базами даних </SPAN></FONT><FONT SIZE=4><SPAN><I><B>(QBE,
	SQL).</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	Класифікація ЯП виходячи з вищезазначеного,
	ЯП можна класифікувати за такими
	ознаками: </SPAN></FONT>",
"l128" => "<FONT SIZE=4><SPAN>За
		ступенем орієнтації на специфічні
		можливості ЕОМ ЯП поділяються на:
		машинно-залежні; машинно-незалежні.
		До машинно-залежних ЯП відносяться
		машинні мови, асемблери і автокоди, що
		використовуються в системному
		програмуванні. Програма на машинно-залежній
		ЯП може виконуватися лише на ЕОМ даного
		типу. Програма на машинно-незалежній
		ЯП після трансляції на машинну мову
		стає машинно-залежною. Ця ознака ЯП
		визначає мобільність одержуваних
		програм (можливість перенесення на
		ЕОМ іншого типу).</SPAN></FONT>",
"l129" => "<FONT SIZE=4><SPAN>За
		ступенем деталізації алгоритму
		одержання результату ЯП поділяються
		на: мови низького рівня;&amp;мови високого
		рівня; мови надвисокого рівня. Рівень
		ЯП визначається на основі складності
		елементів мови, з яких будується
		програма. Найнижчим рівнем є машинна
		мова, а найвищим, мабуть, рівень природної
		мови людини, якою формулюється задача
		типу “Дано:. . . Треба:. . . ”. До мов
		низького рівня належать машинні мови,
		асемблери та автокоди. До мов високого
		рівня належать мови, які мають типи
		даних (наприклад, масиви) та програмні
		конструкції (наприклад, цикли), що
		безпосередньо не реалізуються машинною
		мовою. Взагалі, одному оператору мови
		високого рівня відповідає певна
		програма машинною мовою. Традиційно
		до мов високого рівня відносять мови
		класу FORTRAN, PL/1, Pascal, C, Basic, Ada. До мов
		надвисокого рівня відносять мови, які
		мають найбільш абстрактні механізми
		опису задачі та вбудовані засоби її
		розв’язування. Ці мови дають змогу
		зосередитися на самій задачі, а не на
		деталях її розв’язування. До таких
		мов належать мови класу Lisp, Prolog. </SPAN></FONT>",
"l130" => "<FONT SIZE=4><SPAN>За
		ступенем орієнтації на розв’язування
		задач певного класу ЯП поділяються
		на: проблемно-орієнтовані; універсальні.
		Проблемно-орієнтовані ЯП містять
		спеціалізовані засоби опису та
		розв’язування задач певного класу.
		Універсальні ж ЯП не містять таких
		засобів, дозволяють розв’язувати
		будь-які задачі, але більшими зусиллями.
		</SPAN></FONT>",
"l131" => "<FONT SIZE=4><SPAN>За
		можливістю доповнення новими типами
		даних і операціями ЯП поділяються на
		такі: що розширюються; що не розширюються.
		МП, що дозволяють розширювати склад
		типів даних і операцій, фактично містять
		механізм адаптації мови для розв’язування
		певних задач. Вони є замкнутими МП.</SPAN></FONT>",
"l132" => "<FONT SIZE=4><SPAN>За
		можливістю управління реальними
		об’єктами і процесами ЯП поділяються
		на: мови систем реального часу; мови
		систем умовного часу. Мови систем
		реального часу забезпечують створення
		систем управління реальними об’єктами,
		в яких час є важливим чинником. Однією
		з таких мов є мова Ada, що використовується
		в системах військового призначення
		</SPAN></FONT><FONT SIZE=4><SPAN><I><B>США</B></I></SPAN></FONT><FONT SIZE=4><SPAN>.
		</SPAN></FONT>",
"l133" => "<FONT SIZE=4><SPAN>За
		засобом одержання результату ЯП
		поділяються на: процедурні; непроцедурні.
		Процедурні ЯП потребують задання
		певного алгоритму одержання результату,
		а непроцедурні мають вбудований
		механізм пошуку розв’язку. </SPAN></FONT>",
"l134" => "<FONT SIZE=4><SPAN>За
		типом задач, що розв’язуються, ЯП
		поділяються на: мови системного
		програмування; мови прикладного
		програмування. Як правило, мови
		системного програмування є мовами
		низького рівня і забезпечують найповніше
		використання апаратних можливостей
		ЕОМ. Для розв’язування прикладних
		задач використовуються мови вищих
		рівнів. </SPAN></FONT>",
"l135" => "<FONT SIZE=4><SPAN>Непроцедурні
		мови за типом вбудованої процедури
		пошуку розв’язків поділяються на:
		реляційні; функціональні; логічні. Тип
		вбудованої процедури пошуку розв’язків
		визначає парадигму обчислень і структуру
		програми. </SPAN></FONT>",
"l136" => "<FONT SIZE=4><SPAN>Тенденції розвитку
	ЯП мови системного програмування, на
	яких створюються операційні системи,
	транслятори й інші системні програми,
	розвиваються в напрямку підвищення
	їхнього рівня та незалежності від </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	У наш час майже </SPAN></FONT><FONT SIZE=4><SPAN><I><B>90%</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	системного програмного забезпечення
	створюється не мовою асемблера, а мовою
	C. Наприклад, операційна система Unix
	практично повністю написана мовою C.
	Ця мова дає змогу одержувати програми,
	які за своєю ефективністю не поступаються
	програмам, що написані мовою асемблера.
	Щоправда, збільшується обсяг програм,
	зате ефективність їх створення значно
	вища. Машинна незалежність досягається
	використанням стандарту мови, що
	підтримується всіма розробниками
	трансляторів, а також використанням
	так званих крос-систем для еквівалентного
	перетворення програм з однієї мови
	низького рівня на іншу. Іншим напрямом
	є підвищення рівня самої машинної мови.
	Наприклад, відомі </SPAN></FONT><FONT SIZE=4><SPAN><B>Lisp-машини</B></SPAN></FONT><FONT SIZE=4><SPAN>,
	в яких машинною мовою є мова Lisp
	(реалізована апаратно). Іншим прикладом
	є ЕОМ 5-ї генерації з машинною мовою
	штучного інтелекту Prolog. ЯВР розвиваються
	в напрямку підтримки технологій
	програмування, забезпечення низькорівневих
	операцій (рівня асемблера), забезпечення
	нових інформаційних технологій (НІТ)
	і незалежності від середовища реалізації.
	Слід зазначити, що за своїми можливостями
	ЯВР поступово зближаються і програмістам
	стає все складніше визначати переваги
	тієї чи іншої мови. </SPAN></FONT>",
"l137" => "<FONT SIZE=4><SPAN>Останнім часом широкого
	розповсюдження набула технологія
	об’єктно-орієнтованого програмування
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>(ООП)</B></I></SPAN></FONT><FONT SIZE=4><SPAN>:
	практично всі сучасні </SPAN></FONT><FONT SIZE=4><SPAN><B>ЯВР</B></SPAN></FONT><FONT SIZE=4><SPAN>
	підтримують </SPAN></FONT><FONT SIZE=4><SPAN><B>ООП.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Й усі сучасні програмні системи
	побудовані на її принципах. Сьогодні
	кожний студент, що програмує, знає, що
	таке </SPAN></FONT><FONT SIZE=4><SPAN><I><B>інкапсуляція</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	(приховання деталей реалізації об’єкта),
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>успадкування</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	(побудова нових об’єктів з існуючих)
	і </SPAN></FONT><FONT SIZE=4><SPAN><I><B>поліморфізм</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	(позначення одним ім’ям різних елементів
	програми, які обираються динамічно).
	Для позначення факту підтримки ООП до
	назви мови додають слово Object </SPAN></FONT><FONT SIZE=4><SPAN><B>(наприклад,
	ObjectPascal)</B></SPAN></FONT><FONT SIZE=4><SPAN> або
	інші </SPAN></FONT><FONT SIZE=4><SPAN><B>(наприклад,
	C++)</B></SPAN></FONT><FONT SIZE=4><SPAN>. Windows,
	мережі ЕОМ, сервери, бази даних та
	</SPAN></FONT><FONT SIZE=4><SPAN><B>Internet</B></SPAN></FONT><FONT SIZE=4><SPAN>,
	як основа НІТ, найбільше впливають на
	сучасні </SPAN></FONT><FONT SIZE=4><SPAN><B>МП</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Розробники ЯП тепер зобов’язані
	включати в мови засоби підтримки НІТ,
	щоб привернути програмістів на свою
	сторону. Для підтримки Windows створюються
	системи візуального програмування з
	додатковою назвою Visual, </SPAN></FONT><FONT SIZE=4><SPAN><B>наприклад,
	Visual C++, Visual Basic</B></SPAN></FONT><FONT SIZE=4><SPAN>
	(принципово відрізняється від простого
	Basic) й ін. Для роботи з БД, мережами та
	Internet у ЯП включаються спеціальні
	внутрішні або зовнішні засоби. Прагнення
	до створення програм, що не залежать
	від типу ЕОМ і операційної системи,
	призвело до створенню мови Java. Основне
	завдання мови Java—забезпечити виконання
	програм, що розповсюджуються через
	Web-сторінки Internet, на будь-якій робочій
	станції. Крім того, Java підтримує всі
	засоби НІТ і незабаром, мабуть, стане
	найпопулярнішою МП. Популярність мов
	штучного інтелекту за останні </SPAN></FONT><FONT SIZE=4><SPAN><B>5</B></SPAN></FONT><FONT SIZE=4><SPAN>
	років, на жаль, помітно знизилася. Це
	пов’язано передусім з психологічними
	проблемами, яких зазнають програмісти
	в процесі використання цих мов. Наприклад,
	в найпотужнішій мові </SPAN></FONT><FONT SIZE=4><SPAN><B>Lisp</B></SPAN></FONT><FONT SIZE=4><SPAN>
	програма має дуже складну для розуміння
	спискову структуру і невеликий за
	обсягом проект дуже швидко виходить
	з-під контролю. В мові Prolog програміст
	повинен точно знати логіку роботи
	вбудованої машини логічного виведення,
	а робота програми залежить від структури
	і змісту бази знань </SPAN></FONT><FONT SIZE=4><SPAN><B>(БЗ)</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	Якщо з проектуванням програми і структури
	</SPAN></FONT><FONT SIZE=4><SPAN><B>БЗ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	програміст справляється, то для
	заповнення </SPAN></FONT><FONT SIZE=4><SPAN><B>БЗ</B></SPAN></FONT><FONT SIZE=4><SPAN>
	йому потрібно бути експертом в предметній
	галузі або постійно спілкуватися з
	експертом й використовувати його
	знання, що є складним завданням. Отже,
	щоб мови штучного інтелекту набули
	широкого використання, потрібно створити
	додаткові програмні засоби підтримки
	програмістів. Вивчення питань еволюції
	ЯП спрямоване на полегшення вибору
	мови для розв’язання певних задач.
	Проте слід усвідомлювати, що не потрібно
	вивчати всі існуючі МП. Достатньо
	вивчити по одній мові кожного класу в
	міру потреби, адже в процесі еволюції
	мови одного класу зближаються. І
	пам’ятати головне: найкращою є та мова,
	яку знаєш досконало. </SPAN></FONT>",
"l138" => "<FONT SIZE=4><SPAN><i>Лекцію 
	підготувала<BR>викладач кафедри
	КМПС<BR>Козлюк Оленою Володимирівною.</i></SPAN></FONT>",
"l1t1" => "1) Хто вперше вжив слово «кібернетика»?",
"l1t2" => "2) Що обчислював Вільям Шенкс протягом більш ніж 20 років свого життя?",
"l1t3" => "Формулу Ньютона  ",
"l1t4" => "Число Pi  ",
"l1t5" => "Тригонометричні функції",
"l1t6" => "3) У якому році вступила в дію перша ЕОМ?",
"l1t7" => "1951р.",
"l1t8" => "1988р.",
"l1t9" => "1944р.",
"l1t10" => "4) Що таке МП?",
"l1t11" => "Модульне програмування",
"l1t12" => "Мана Поінтс",
"l1t13" => "Мова програмування",
"l1t14" => "5) Хто був першим програмістом?",
"l1t15" => "Чарльз Беббідж",
"l1t16" => "Лорд Байрон",
"l1t17" => "Ада Лавлейс",
"l1t18" => "Комп’ютер",
"l1t19" => "6) Чим представляються дані машинною мовою?",
"l1t20" => "Бінарним кодом(0 та 1) ",
"l1t21" => "Програмним кодом",
"l1t22" => "Цифрами 1-9",
"l1t23" => "7)	Що таке «Асемблер»?",
"l1t24" => "Перша ЕОМ",
"l1t25" => "Програма для розрахунків",
"l1t26" => "Мова програмування",
"l1t27" => "",
"l1t28" => "",
"l1t29" => "",

"l2t1" => "1)	Що є характерною ознакою другого етапу розвитку інформаційних технологій?",
"l2t2" => "мова",
"l2t3" => "писемність",
"l2t4" => "електрика",
"l2t5" => "2)	Хто був керівником лабораторії, де була створена перша ЕОМ?",
"l2t6" => "Лебедєв",
"l2t7" => "Сергій Лавлейс",
"l2t8" => "3)	Що спричинило масштабне зростання міжнародних спілкувань у різних сферах людського життя в сучасному світі?",
"l2t9" => "4)	Що таке соціальна мережа?",
"l2t10" => "Веб-сайт",
"l2t11" => "інформаційна система",
"l2t12" => "структура",
"l2t13" => "5)	Яка була площа першої ЕОМ?",
"l2t14" => "60м<sup>2</sup>	",
"l2t15" => "25м<sup>2</sup>",
"l2t16" => "6000см<sup>2</sup>",
"l2t17" => "Свердлов С.О.",
"l2t18" => "",
"l2t19" => "",
"l2t20" => "",

"l3t1" => "1)	Скільки етапів розвитку обчислювальної техніки Вам відомо?",
"l3t2" => "2)	Назва якої відомої компанії вказана у відео на одній з машин перших чотирьох поколінь?",
"l3t3" => "DELL",
"l3t4" => "IBM",
"l3t5" => "Microsoft",
"l3t6" => "NVIDIA ",
"l3t7" => "3)	Що таке Sunway Taihulight?",
"l3t8" => "4)	На що були схожі перші комп’ютери?",
"l3t9" => "Великі прямоткутні коробки",
"l3t10" => "Книжкові шафи",
"l3t11" => "компактні ПК",
"l3t12" => "5)	З якою швидкістю працювали перші ЕОМ?",
"l3t13" => "10-20 тис. оп/сек.",
"l3t14" => "1000 оп./сек",
"l3t15" => "10000оп/хв",
"l3t16" => "6)	Що об’єднує всі використані у відео фільми?",
"l3t17" => "Великий бюджет",
"l3t18" => "Штучний інтелект",
"l3t19" => "Злодії",
"l3t20" => "",

"l4t1" => "1) Яка середня ЗП IT-спеціаліста?",
"l4t2" => "2) Frontend – це:",
"l4t3" => "Створення дизайну",
"l4t4" => "створення логіки",
"l4t5" => "створення зображень",
"l4t6" => "3) Найпопулярніша МП за останніми даними?",
"l4t7" => "4)	Дві літери, що символізують процес тестування, знаходження багів тощо:",
"l4t8" => "Будує основу додатку",
"l4t9" => "Будує основу додатку",
"l4t10" => "Управляє проектом",
"l4t11" => "6)	JS, C#, Java – об’єктно-орієнтовані мови програмування чи структурні?",
"l4t12" => "ООП	",
"l4t13" => "Структура",

"l5t1" => "1)	Яка вправа описана у лекції?",
"l5t2" => "2)	Ряд дій або кроків, зроблених для досягнення мети.",
"l5t3" => "Процес",
"l5t4" => "Процедура",
"l5t5" => "Алгоритм",
"l5t6" => "3)	Ряд дій, які виконуються в певному порядку.",
"l5t7" => "4)	Упорядкований набір кроків для вирішення завдання.",
"l5t8" => "5)	На думку лектора – програмування – це:",
"l5t9" => "Не для всіх",
"l5t10" => "весело",
"l5t11" => "важко",
"l5t12" => "неможливо",
"l5t13" => "6)	Мови програмування розподіляються на наступні рівні:",
"l5t14" => "Низького та високого рівня",
"l5t15" => "Складного і легкого рівня",
"l5t16" => "початковий і професіональний",
"l5t17" => "",
"l5t18" => "",

"lgonext" => "Перейти до лекції",


/////////////////////////////////////////////////////////////////////////////////Лекция 2
"l20" => "Лекція №2",
"l21" => "<SPAN>Лекція
	2.<BR>Що таке інформаційні технології?</SPAN>",
"l22" => "<FONT SIZE=4><SPAN>Початком ери
	інформаційних технологій </SPAN></FONT><FONT SIZE=4><SPAN><B>(ІТ)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	можна вважати той час, коли людина
	почала виокремлювати себе серед
	оточуючого світу: мова, усне відтворення
	інформації, передавання її за допомогою
	знаків, звуків - усе це можна назвати
	першим етапом розвитку інформаційних
	технологій. До наших часів дійшли його
	продукти у вигляді наскальних зображень,
	усної народної творчості, символів на
	предметах побуту, тощо. </SPAN></FONT>",
"l23" => "<FONT SIZE=4><SPAN>Поява </SPAN></FONT><FONT SIZE=4><SPAN><B>писемності</B></SPAN></FONT><FONT SIZE=4><SPAN>
	є характерною ознакою другого етапу
	розвитку інформаційних технологій.
	Завдяки можливості відтворення
	інформації на матеріальних носіях
	(дерев'яні, вкриті воском або глиняні
	таблички, папірус, шкіра) утворюються
	перші сховища інформації - </SPAN></FONT><FONT SIZE=4><SPAN><B>бібліотеки.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Масовому поширенню інформації сприяла
	поява і розвиток книгодрукування. </SPAN></FONT>",
"l24" => "<FONT SIZE=4><SPAN>Третім етапом розвитку
	інформаційних технологій можна назвати
	період появи і швидкого впровадження
	механічних засобів обробки, зберігання
	і передачі інформації, таких як друкарська
	машинка чи арифмометр. </SPAN></FONT>",
"l25" => "<FONT SIZE=4><SPAN>Відкриття в галузі
	</SPAN></FONT><FONT SIZE=4><SPAN><B>електрики</B></SPAN></FONT><FONT SIZE=4><SPAN>
	зробило революцію і в інформаційних
	технологіях, зумовило перехід до
	четвертого етапу їх розвитку. З'явилась
	можливість передачі значних обсягів
	інформації на великі відстані з достатньо
	великою швидкістю, зберігання їх на
	магнітних носіях. </SPAN></FONT>",
"l26" => "<FONT SIZE=4><SPAN>Початок п'ятого етапу
	розвитку інформаційних технологій
	пов'язують з появою перших
	електронно-обчислювальних машин </SPAN></FONT><FONT SIZE=4><SPAN><B>(ЕОМ)</B></SPAN></FONT><FONT SIZE=4><SPAN>
	та переходом до електронно-цифрових
	технологій. </SPAN></FONT>",
"l27" => "<FONT SIZE=4><SPAN>В порівнянні з
	аналоговими, основною перевагою
	електронних джерел інформації є їх
	оперативність і зростаюча масовість
	(наочний приклад - інформація в мережі
	Інтернет). Швидкий розвиток комп'ютерної
	техніки породжує нові форми і методи
	обробки, зберігання і передавання
	інформації. </SPAN></FONT>",
"l28" => "<FONT SIZE=4><SPAN>Можна відокремити
	такі етапи розвитку комп'ютерних
	інформаційних технологій: </SPAN></FONT>",
"l29" => "<FONT SIZE=4><SPAN>- етап машинних ресурсів
	(впровадження ЕОМ, програмування в
	кодах машин);<BR>- етап програмування
	(мови програмування, пакетна обробка);<BR>-
	етап нових інформаційних технологій,
	який характеризується появою ПЕОМ
	(персональних ЕОМ чи скорочено ПК -
	персональний комп'ютер), комп'ютерних
	мереж, АРМів (автоматизованих робочих
	місць), баз даних, О</SPAN></FONT><FONT SIZE=4>L</FONT><FONT SIZE=4><SPAN>АР-технології
	(динамічний аналіз даних), Інтернет-технологій,
	тощо.</SPAN></FONT>",
"l210" => "<FONT SIZE=4><SPAN><BR></SPAN></FONT><FONT SIZE=4><SPAN><B>Як
	народжувався перший комп'ютер.</B></SPAN></FONT>",
"l211" => "<FONT SIZE=4><SPAN>Мало хто знає, що
	перший в континентальній Європі
	комп'ютер був створений в </SPAN></FONT><FONT SIZE=4><SPAN><I><B>Україні
	понад </B></I></SPAN></FONT><FONT SIZE=4><SPAN><B>60
	років</B></SPAN></FONT><FONT SIZE=4><SPAN> тому
	в </SPAN></FONT><FONT SIZE=4><SPAN><B>1951 році</B></SPAN></FONT><FONT SIZE=4><SPAN>.
	</SPAN></FONT><FONT SIZE=4>Перша </FONT><FONT SIZE=4><B>ЕОМ
	</B></FONT><FONT SIZE=4>називалася Малою електронною
	лічильною машиною – </FONT><FONT SIZE=4><B>«МЭСМ».</B></FONT><FONT SIZE=4>
	</FONT><FONT SIZE=4><SPAN>Незважаючи на
	скромне слово </SPAN></FONT><FONT SIZE=4><SPAN><B>«Мала»,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	вона налічувала </SPAN></FONT><FONT SIZE=4><SPAN><B>6000</B></SPAN></FONT><FONT SIZE=4><SPAN>
	електронних ламп і ледь вмістилася в
	лівому крилі будівлі гуртожитку
	колишнього монастирського селища
	Феофанія в 10 км від Києва. Машина була
	створена в лабораторії обчислювальної
	техніки Інституту електротехніки </SPAN></FONT><FONT SIZE=4><SPAN><B>АН
	УРСР</B></SPAN></FONT><FONT SIZE=4><SPAN> під
	керівництвом академіка </SPAN></FONT><FONT SIZE=4><SPAN><B>Сергія
	Олексійовича Лебедєва.</B></SPAN></FONT>",
"l212" => "<FONT SIZE=4><SPAN>Почалося все у далекі
	</SPAN></FONT><FONT SIZE=4><SPAN><B>30-ті роки ХХ
	століття. </B></SPAN></FONT><FONT SIZE=4><SPAN>Тоді
	молодий ще вчений Сергій Лебедєв
	займався дослідженнями зі стійкості
	енергосистем у Всесоюзному електротехнічному
	інституті в Москві. Йому доводилося
	виконувати численні розрахунки, і
	Лебедєв починає шукати способи
	автоматизувати і прискорити процес
	обчислень. Так у вченого народжуються
	перші конкретні думки про створення
	нової машини, яка могла б автоматично
	виконувати складні розрахунки. Але
	Велика Вітчизняна Війна змушує відкласти
	задуману роботу. Тим не менш, аж до
	евакуації з Москви Лебедєв продовжував
	думати над тим, як реалізувати свої
	ідеї. </SPAN></FONT>",
"l213" => "<FONT SIZE=4><SPAN>На початку осені </SPAN></FONT><FONT SIZE=4><SPAN><B>1941
	року</B></SPAN></FONT><FONT SIZE=4><SPAN> сім'ю
	</SPAN></FONT><FONT SIZE=4><SPAN><B>С.О.Лебедєва</B></SPAN></FONT><FONT SIZE=4><SPAN>
	евакуюють у Свердловськ, де </SPAN></FONT><FONT SIZE=4><SPAN><B>Сергій
	Олексійович</B></SPAN></FONT><FONT SIZE=4><SPAN>
	займається важливими для фронту
	розробками: в короткі терміни створює
	систему стабілізації для наведення
	танкової гармати, а потім - для самонавідної
	торпеди, використовуючи аналогові
	елементи. </SPAN></FONT>",
"l214" => "<FONT SIZE=4><SPAN><B>У 1944 році</B></SPAN></FONT><FONT SIZE=4><SPAN>
	Лебедєв повертається до Москви, а потім
	приїжджає до Києва і стає директором
	Інституту електротехніки АН УРСР. </SPAN></FONT><FONT SIZE=4><SPAN><B>У
	1945 р.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	С.О.Лебедєв був обраний академіком і
	призначений директором Інституту
	енергетики. Через півроку інститут
	розділили на дві частини - Інститут
	електротехніки та Інститут теплотехніки.
	С.О.Лебедєв став директором Інституту
	електротехніки. </SPAN></FONT>",
"l215" => "<FONT SIZE=4><SPAN>У той час пріоритетними
	напрямками в науці вважалися ракетна
	техніка, атомна енергетика, дослідження
	космосу. Але Лебедєв залишається вірним
	своєму довоєнному задуму - створити
	цифрову електронну обчислювальну
	машину. </SPAN></FONT>",
"l216" => "<FONT SIZE=4><SPAN>Інституту електротехніки
	виділяють напівзруйновану будівлю
	монастирського готелю в передмісті
	Києва - Феофанії. До війни в цій будівлі
	розміщувався філіал Київської
	психіатричної лікарні. Німецькі
	окупанти, вступивши до Феофанії,
	перестріляли хворих і зайняли будівлю
	під госпіталь. Під час обстрілів при
	звільненні Києва будинок було значно
	пошкоджено. У такому вигляді він й
	надійшов в розпорядження Академії наук
	</SPAN></FONT><FONT SIZE=4><SPAN><B>УРСР</B></SPAN></FONT><FONT SIZE=4><SPAN>
	в </SPAN></FONT><FONT SIZE=4><SPAN><B>1948 р.</B></SPAN></FONT><FONT SIZE=4><SPAN>
	і був переданий Інституту електротехніки
	АН УРСР для розміщення лабораторії
	директора інституту С.О. Лебедєва. </SPAN></FONT>",
"l217" => "<FONT SIZE=4><SPAN>Будівлю було
	відремонтовано. На першому поверсі
	почалися роботи з проектування тоді
	секретної електронної лічильної машини.
	Найбільша кімната відводилася для
	майбутнього дітища С.О. Лебедєва.
	З'явилися механічні майстерні, в підвалі
	- джерела електроживлення для машини.
	</SPAN></FONT>",
"l218" => "<FONT SIZE=4><SPAN>Якщо згадати короткий
	часовий проміжок, за який була
	спроектована, змонтована і налагоджена
	«МЭСМ» - три роки, і врахувати, що в
	розробці і створенні </SPAN></FONT><FONT SIZE=4><SPAN><B>«МЭСМ»</B></SPAN></FONT><FONT SIZE=4><SPAN>
	брали участь 12 інженерів (разом з С.О.
	Лебедєвим), яким допомагали 15 техніків
	та монтажниць (в створенні першої
	американської </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ
	«</B></SPAN></FONT><FONT SIZE=4><B>ENIAC</B></FONT><FONT SIZE=4><SPAN><B>»</B></SPAN></FONT><FONT SIZE=4><SPAN>
	- 13 основних виконавців, 200 техніків і
	велика кількість робітників), то стає
	зрозумілим, що С.О. Лебедєв та очолюваний
	ним колектив здійснив, здавалося б,
	неможливе. </SPAN></FONT>",
"l219" => "<FONT SIZE=4><SPAN>Машина займала
	найбільшу кімнату площею </SPAN></FONT><FONT SIZE=4><SPAN><B>60
	м2</B></SPAN></FONT><FONT SIZE=4><SPAN> у лівому
	крилі лабораторії в Феофанії і працювала
	з небувалою на ті часи швидкістю - 3
	тисячі операцій за хвилину (для
	порівняння, сучасні комп'ютери виконують
	мільйони операцій за секунду) і могла
	виконувати операції віднімання,
	додавання, множення, ділення, зсуву,
	порівняння з урахуванням знака,
	порівняння за абсолютною величиною,
	передачі керування, передачі чисел з
	магнітного барабану, складання команд.
	У машині були використані електронні
	лампи </SPAN></FONT><FONT SIZE=4><SPAN><B>(6000
	штук!) </B></SPAN></FONT><FONT SIZE=4><SPAN>загальною
	потужністю споживання в </SPAN></FONT><FONT SIZE=4><SPAN><B>25
	кВт.</B></SPAN></FONT><FONT SIZE=4><SPAN> Перший
	запуск </SPAN></FONT><FONT SIZE=4><SPAN><B>«МЭСМ»</B></SPAN></FONT><FONT SIZE=4><SPAN>
	запам'ятався саме «ламповою проблемою»:
	при включенні машини </SPAN></FONT><FONT SIZE=4><SPAN><B>6000
	ламп</B></SPAN></FONT><FONT SIZE=4><SPAN>, що
	запрацювали одночасно, перетворили
	приміщення в тропіки. Технікам довелося
	терміново розбирати стелю, щоб відвести
	з кімнати хоча б частину тепла. </SPAN></FONT><FONT SIZE=4><SPAN>Машина займала
	найбільшу кімнату площею </SPAN></FONT><FONT SIZE=4><SPAN><B>60
	м2</B></SPAN></FONT><FONT SIZE=4><SPAN> у лівому
	крилі лабораторії в Феофанії і працювала
	з небувалою на ті часи швидкістю - 3
	тисячі операцій за хвилину (для
	порівняння, сучасні комп'ютери виконують
	мільйони операцій за секунду) і могла
	виконувати операції віднімання,
	додавання, множення, ділення, зсуву,
	порівняння з урахуванням знака,
	порівняння за абсолютною величиною,
	передачі керування, передачі чисел з
	магнітного барабану, складання команд.
	У машині були використані електронні
	лампи </SPAN></FONT><FONT SIZE=4><SPAN><B>(6000
	штук!) </B></SPAN></FONT><FONT SIZE=4><SPAN>загальною
	потужністю споживання в </SPAN></FONT><FONT SIZE=4><SPAN><B>25
	кВт.</B></SPAN></FONT><FONT SIZE=4><SPAN> Перший
	запуск </SPAN></FONT><FONT SIZE=4><SPAN><B>«МЭСМ»</B></SPAN></FONT><FONT SIZE=4><SPAN>
	запам'ятався саме «ламповою проблемою»:
	при включенні машини </SPAN></FONT><FONT SIZE=4><SPAN><B>6000
	ламп</B></SPAN></FONT><FONT SIZE=4><SPAN>, що
	запрацювали одночасно, перетворили
	приміщення в тропіки. Технікам довелося
	терміново розбирати стелю, щоб відвести
	з кімнати хоча б частину тепла. </SPAN></FONT>",
"l220" => "<FONT SIZE=4><SPAN><B>Академік С.О. Лебедєв,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	переїхав до Москви і став директором
	Інституту точної механіки та обчислювальної
	техніки АН СРСР. За наступні </SPAN></FONT><FONT SIZE=4><SPAN><B>20
	років</B></SPAN></FONT><FONT SIZE=4><SPAN> під
	його керівництвом </SPAN></FONT><FONT SIZE=4><SPAN><I>було
	створено</I></SPAN></FONT><FONT SIZE=4><SPAN><B>18</B></SPAN></FONT><FONT SIZE=4><SPAN>
	суперкомп'ютерів. Як основоположник
	вітчизняної обчислювальної техніки
	він зайняв гідне місце в зоряній плеяді
	комп'ютерних піонерів світу. </SPAN></FONT>",
"l221" => "<SPAN>Інформаційні технології в
	сучасному світі</SPAN>",
"l222" => "<FONT SIZE=4><SPAN>Сьогоднішній світ
	перейшов на новий етап життя, де головну
	роль виконує інформація, а також
	економіка, що будується на ній. Сучасний
	розвиток інформаційного суспільства
	безпосередньо пов'язаний з необхідністю
	збору, обробки і передачі величезних
	об'ємів інформації, перетворенням
	інформації у товар, як правило, значної
	вартості. Це стало причиною глобального
	переходу від індустріального суспільства
	до інформаційного. Поява всесвітньої
	мережі </SPAN></FONT><FONT SIZE=4><SPAN><I><B>Інтернет</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	спричинила масштабне зростання
	міжнародних спілкувань у різних сферах
	людського життя. </SPAN></FONT>",
"l223" => "<FONT SIZE=4><B>Інформація</B></FONT><FONT SIZE=4> є
	одним з найцінніших ресурсів суспільства
	поруч з традиційними матеріальними
	видами ресурсів, як нафта, метал, корисні
	копалини тощо, тому, процес переробки
	інформації, подібно до процесів переробки
	матеріальних ресурсів можна сприймати
	як технологію. Інформаційна технологія
	передбачає вміння грамотно працювати
	з інформацією і обчислювальною технікою.
	</FONT>",
"l224" => "<FONT SIZE=4><SPAN>Отож, що ж таке
	інформаційні технології? </SPAN></FONT>",
"l225" => "<FONT SIZE=4><SPAN>На нашу думку, під
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>інформаційними</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	технологіями слід розуміти комплекс
	взаємозалежних, наукових, технологічних,
	інженерних дисциплін, що вивчають
	методи ефективної організації праці
	людей, зайнятих обробкою і зберіганням
	інформації; обчислювальну техніку і
	методи організації і взаємодії з людьми
	і виробничим устаткуванням, їх практичні
	додатки, а також зв'язані з усім цим
	соціальні, економічні та культурні
	проблеми. </SPAN></FONT>",
"l226" => "<FONT SIZE=4><SPAN>Самі інформаційні
	технології вимагають складної підготовки,
	великих первісних витрат і наукомісткої
	техніки. Їх введення повинно починатися
	зі створення математичного забезпечення,
	формування інформаційних потоків у
	системах підготовки фахівців. </SPAN></FONT>",
"l227" => "<FONT SIZE=4><SPAN>На сьогодні інформаційні
	технології займають велике місце в
	нашому житті. Застосування </SPAN></FONT><FONT SIZE=4><SPAN><B>ЕОМ</B></SPAN></FONT><FONT SIZE=4><SPAN>стало
	буденною справою, хоча ще зовсім недавно
	робоче місце, обладнане комп'ютером,
	було великою рідкістю. Інформаційні
	технології дали нові можливості для
	роботи і відпочинку,багато в чому
	полегшили працю і просто життя кожної
	сучасної людини. Теперішнє суспільство
	навряд чи можна уявити без інформаційних
	технологій. </SPAN></FONT>",
"l228" => "<FONT SIZE=4><SPAN>Інформаційні технологій
	дуже швидко перетворилися на життєво
	важливий стимул розвитку не тільки
	світової економіки, а й інших сфер
	людської діяльності. На сьогодні
	практично неможливо знайти сферу, в
	якій зараз не використовуються
	інформаційні технології. </SPAN></FONT>",
"l229" => "<FONT SIZE=4><SPAN>Не можливо оцінити
	важливість застосування інформаційних
	технологій у сфері освіти та науковій
	сфері. Зараз важко уявити собі школу,
	в якій би не було комп'ютерного класу,
	існує багато електронних бібліотек,
	користуватися якими можна не виходячи
	з дому, що значно полегшує процес
	навчання і самоосвіти. І при цьому
	інформаційні технології сприяють
	розвитку наукових знань. </SPAN></FONT>",
"l230" => "<FONT SIZE=4><SPAN>Збільшується </SPAN></FONT><FONT SIZE=4><SPAN><I>швидкість</I></SPAN></FONT><FONT SIZE=4><SPAN>
	обміну інформацією і з'являється
	можливість проводити складні математичні
	розрахунки за кілька секунд і багато
	іншого. Інформаційні технології це
	один із сучасних способів спілкування,
	головними перевагами якого є
	загальнодоступність. Використовуючи
	інформаційні технології можна з легкістю
	отримати доступ до цікавить вас
	інформації, а також поспілкуватися з
	живою людиною. З одного боку це має
	негативний ефект, оскільки люди все
	менше спілкуються </SPAN></FONT><FONT SIZE=4><SPAN><I><B>&quot;вживу&quot;,</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	при безпосередньому контакті, але з
	іншого боку дозволять спілкуватися з
	людиною, яка знаходиться на іншому
	кінці світу, а це погодьтеся, має
	величезне значення. </SPAN></FONT>",
"l231" => "<FONT SIZE=4><SPAN>Сучасні інформаційні
	технології увібрали в себе лавиноподібні
	досягнення електроніки, а також
	математики, філософії, психології та
	економіки. Утворений в результаті
	життєздатний </SPAN></FONT><FONT SIZE=4><SPAN><I>гібрид</I></SPAN></FONT><FONT SIZE=4><SPAN>
	ознаменував революційний стрибок в
	історії інформаційних технологій, яка
	налічує сотні тисяч років. </SPAN></FONT>",
"l232" => "<FONT SIZE=4><SPAN>Виробництво і транспорт,
	банки та біржі, засоби масової інформації
	і видавництва, оборонні системи,
	соціальні та правоохоронні бази даних,
	сервіс і охорона здоров'я, навчальні
	процеси, офіси для переробки наукової
	та ділової інформації, нарешті, Інтернет
	- усюди інформаційні технології.
	Інформаційна насиченість не тільки
	змінила світ, а й створила нові проблеми,
	які не можна було передбачити. </SPAN></FONT>",
"l233" => "<FONT SIZE=4><SPAN>Сучасне суспільство
	просто переповнене потоками </SPAN></FONT><FONT SIZE=4><SPAN><B>інформації,</B></SPAN></FONT><FONT SIZE=4><SPAN>
	які безсумнівно потребують обробки.
	Через це без інформаційних технологій,
	так само як без енергетичних, транспортних
	і хімічних технологій, наше суспільство
	нормально функціонувати не може і не
	буде. </SPAN></FONT>",
"l234" => "<FONT SIZE=4><SPAN>З розвитком сучасних
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>інформаційних</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	технологій зростає прозорість світу,
	швидкість і обсяги передачі інформації
	між елементами світової системи,
	з'являється ще один інтегруючий світової
	фактор. Це означає, що роль місцевих
	традицій, що сприяють самодостатньому
	інерційному розвитку окремих елементів,
	слабшає. Одночасно посилюється реакція
	елементів на сигнали з позитивним
	зворотним зв'язком. Інтеграцію можна
	було б тільки вітати, якби її наслідком
	не ставало розмивання регіональних і
	культурно-історичних особливостей
	розвитку. </SPAN></FONT>",
"l235" => "<FONT SIZE=4><SPAN>Сучасні </SPAN></FONT><FONT SIZE=4><SPAN><I><B>інформаційні</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	технології стають одним з найбільш
	прибуткових та швидко зростаючих
	секторів економіки. Інформація стала
	важливим виробничим і комерційним
	ресурсом. </SPAN></FONT>",
"l236" => "<FONT SIZE=4><SPAN>Варто розглянути
	вплив інформаційних технологій на
	розвиток соціальних мереж, які є дієвим
	засобом і особливим інструментом
	маркетингу. </SPAN></FONT>",
"l237" => "<FONT SIZE=4><SPAN><I><B>Соціальна мережа</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	– це структура, що базується на соціальних
	зв’язках та взаємних інтересах окремих
	індивідів та організацій в цілому.
	Завдання такого ресурсу полягає в
	забезпеченні користувачів усіма
	можливим засобами взаємодії одне з
	одним – відео, чатами, зображеннями,
	музикою, блогами тощо. </SPAN></FONT>",
"l238" => "<FONT SIZE=4><SPAN>За кілька останніх
	років соціальні мережі стали
	найпопулярнішими ресурсами в Інтернеті:
	сьогодні </SPAN></FONT><FONT SIZE=4><I>Facebook</I></FONT><FONT SIZE=4><SPAN><I>,
	</I></SPAN></FONT><FONT SIZE=4><I>Twitter</I></FONT><FONT SIZE=4><SPAN><I>
	і </I></SPAN></FONT><FONT SIZE=4><I>Linkedin</I></FONT><FONT SIZE=4><SPAN><I>
	у </I></SPAN></FONT><FONT SIZE=4><SPAN><I><B>США й
	Західній Європі</B></I></SPAN></FONT><FONT SIZE=4><SPAN>,
	а Вконтакте й Однокласники в країнах
	</SPAN></FONT><FONT SIZE=4><SPAN><B>СНД</B></SPAN></FONT><FONT SIZE=4><SPAN>
	– це сайти з мільйонами активних
	користувачів. Ці ресурси відвідують
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>75%</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	українських користувачів </SPAN></FONT><FONT SIZE=4><SPAN><I><B>Інтернету.</B></I></SPAN></FONT>",
"l239" => "<FONT SIZE=4><SPAN>Соціальні мережі
	справді заповнили наш світ. А це сталося
	завдяки швидкому розвитку інформаційних
	технологій в цілому. </SPAN></FONT>",
"l240" => "<FONT SIZE=4><SPAN>Внаслідок глобалізації
	інформаційних технологій різноманітні
	суспільні проблеми і протиріччя часто
	відображаються у вигляді
	інформаційно-психологічних операцій
	або, досить популярних на сьогодні -
	</SPAN></FONT><FONT SIZE=4><SPAN><I><B>війн.</B></I></SPAN></FONT>",
"l241" => "<FONT SIZE=4><SPAN><I>Зараз важко знайти
	сферу, в якій ще не використовуються
	інформаційні технології. Підвівши
	підсумок, можна сказати, що інформаційні
	технології глибоко проникли в наше
	життя і сучасне суспільство, яке не
	зможе в нинішньому вигляді існувати
	без них.</I></SPAN></FONT>",
"l242" => "<FONT SIZE=4><SPAN><I><B>Сучасне суспільство</B></I></SPAN></FONT><FONT SIZE=4><SPAN>
	навряд чи можна уявити без інформаційних
	технологій. Перспективи їх розвитку
	сьогодні складно уявити навіть фахівцям.
	Проте, ясно, що в майбутньому нас чекає
	щось грандіозне. І якщо темпи розвитку
	інформаційних технологій не скоротяться
	(а в цьому немає ніяких сумнівів), то це
	відбудеться дуже скоро. </SPAN></FONT>",
"l243" => "<FONT SIZE=4><SPAN><i>Лекцію 
	підготувала<BR>викладач кафедри
	КМПС<BR>Козлюк Оленою Володимирівною.</i></SPAN></FONT>",
////////////////////////////////////////////////////////////////////////////////////////////////////Лекция 3
"l30" => "Лекція №3",
"l31" => "<SPAN>Лекція
3.</SPAN>",
"l32" => "Шлях
комп'ютерних наук - від перших обчислювальних
машин<br>до
всебічної інформатизації сьогодні",
"l33" => "<SPAN></SPAN>",
"l34" => "<i><font size=6><b>Л</b></font>юдина — книга.<br>
<b>П</b>равда деякі складаються всього з однієї сторінки...<br>
<b>і</b> та у соц. мережі.<br>
<b>А</b> хто Ви?<br>
<b>Н</b>евідомий автор.</i>
",

"l39" => "<font size=6><b>О</b></font>тже,
що Вам відомо про комп'ютери? Думаю, якщо
Ви опинилися на цій сторінці, то багато.
А що Ви знаєте про історію виникнення
комп'ютерів? Про те, що було до ноутбука
або стаціонарного ПК, що стоїть перед
Вами? Першим етапом розвитку обчислювальної
техніки є ручний етап:<br><br>",
"l310" => "<font size=6><b>С</b></font>першу
люди рахували на пальцях, потім наносили
зарубки, з'явилися прилади, що використовують
обчислення за розрядами, це абак, інші
різновиди рахунків. Логарифмічна лінійка
- останній засіб для рахунку, яке відносять
до ручного етапу.<br><br>",
"l311" => "",
"l312" => "<font size=6><b>У</b></font> XVII столітті активно розвивалися всі
галузі механіки і це стало передумовою
для створення обчислювальних пристроїв,
які використовують механічний принцип
обчислення. Такі пристрої будувалися
на механічних елементах і забезпечували
автоматичний перенос старшого розряду.
Ці пристрої були здатні виконувати вже
не дві, а чотири арифметичні дії і
називалися арифмометрами.<br><br>",
"l313" => "Е",
"l314" => "<font size=6><b>Е</b></font>лектромеханічний
етап розвитку обчислювальної техніки
з'явився найменш тривалим і охоплює
близько 60 років. Передумовами створення
проектів даного етапу з'явилися як
необхідність проведення масових
розрахунків (економіка, статистика,
управління і планування, і ін), так і
розвиток прикладної електротехніки
(електропривод і електромеханічні
реле), що дозволили створювати
електромеханічні обчислювальні пристрої.
Вже на цьому етапі виявляється залежність
можливостей обчислювальної техніки
від її системної складності; багато
напрацювання даного етапу лягли в основу
розвитку сучасного етапу розвитку ВТ
- електронного.<br><br> ",
"l315" => "Н",
"l316" => "<font size=6><b>Н</b></font>у,
здається, навіть така кількість тексту
була трохи нудною, так? Тому пропоную
відпочити і подивитися відео про більш
сучасну комп'ютерну техніку. Приємного
перегляду:)<br><br><br> ",
"l317" => "Н",
"l318" => "<font size=6><b>Н</b></font>а
нашій кафедрі &quot;Комп’ютерного
моделювання процесів та систем&quot; також
є кластер, за допомогою якого виробляються
ресурсномісткі розрахунки та обчислення.
Звичайно, не Sunway Taihulight, як у відео, але
все ж кілька десятків ядер, оперативної
пам'яті і пара GeForce GTX 1080 Sea Hawk + NVIDIA Quadro.<br><br> ",
"l319" => "Н",
"l320" => "<font size=6><b>Н</b></font>ижче
наведені деякі наукові приклади
застосування суперкомп'ютерів, допомагають
людству буквально у всьому. Всі сайти,
соціальні мережі, форуми вони також
зберігаються на серверах, що представляють
собою кластери.<br><br>",
"l321" => "<i><br><br>Лекцію підготував<br> 
студентом кафедри КМПС<br> 
Васильчук Олександром.</i><br> 
",
"l322" => "",
"l323" => "",
"l324" => "",
//////////////////////////////////////////////////////////////////////////////Лекция 4
"l41" => "Лекція №4",
"l42" => "Лекція 4<br>Чим займаються IT -
фахівці?<br><br>",
"l43" => "<SPAN>Чим же займаються IT -
фахівці? Для початку варто відзначити,
що кількість IT - фахівців в Україні
зростає. Нижче наведено графік динаміки
зростання IT-фахівців в Україні. </SPAN>",
"l44" => "<FONT SIZE=4><SPAN>А тепер перейдемо до
основної теми лекції. </SPAN></FONT>",
"l45" => "<FONT SIZE=4><SPAN><b>Посада: програміст</b></SPAN></FONT>",
"l46" => "<FONT SIZE=4><SPAN>Програмістів можна
поділити за напрямами розробки, наприклад
back-end, front-end, мобільні додатки і т. д. На
декількох напрямках ми зупинимося
окремо. </SPAN></FONT>",
"l47" => "<FONT SIZE=4><SPAN><b>Backend програміст</b></SPAN></FONT>",
"l48" => "<FONT SIZE=4><SPAN>Backend програміст - це
той фахівець web-програмування, який
програмує і створює серверну частину
веб-сайту. Він забезпечує вивід необхідного
контенту з бази даних у потрібних
ділянках web-сайту, автоматизує процес
збору інформації про користувачів,
захищає сайт від злому і всіляких DoS і
DDoS атак. Це внутрішня логіка і робота
сайту. </SPAN></FONT>",
"l49" => "<b>Frontend програміст</b>",
"l410" => "<FONT SIZE=4><SPAN>Frontend програміст - це
фахівці, які добре знають web програмування
клієнтської частини веб-сайту. Можна
сказати, що їх завданням є створення
привабливого і зручного веб-дизайну і
інтерфейсу, які в свою чергу є показниками
якісного програмного забезпечення.
Також від веб-дизайну залежить кількість
користувачів інтернет-ресурсу, що
важливо прийняти до уваги програмісту
при розробці веб-додатки. Вміння правильно
використовувати web-дизайн є великим
плюсом для розробника. Front-end програміст
повинен добре володіти HTML розміткою,
CSS, мовою програмування JavaScript також
фреймворком цієї мови, таким як JQuery, ще
він повинен знати правила правильного
зручного інтерфейсу. Хороший front-end
програміст знає серверні мови, що
необхідно для розуміння взаємозв'язку
клієнтської частини з серверної стороною,
в цьому питанні не обійтися без Ajax
технології. Все перераховане вище є
основним для web програмування, проте,
дуже часто Webfront-end фахівці використовують
багато інші технології для забезпечення
&quot;юзабіліті&quot;, &quot;евристики&quot;,
&quot;кросбраузерності&quot;. </SPAN></FONT>",
"l411" => "<FONT SIZE=4><SPAN><b>Mobile-розробник</b></SPAN></FONT>",
"l412" => "<FONT SIZE=4><SPAN>Mobile-розробник - фахівець,
який створює додатки для мобільних
пристроїв (смартфони, планшети, розумні
годинник). Такому фахівцю необхідно
знати основи проектування програми для
мобільних пристроїв, розуміти життєвий
цикл мобільного додатку, механізм
публікації додатка в AppleStore і
GoogleplayMarket, знати способи зробити додаток
безпечним і запобігти витоку даних. </SPAN></FONT>",
"l413" => "<FONT SIZE=4><SPAN>Якими мовами програмування
користуються IT - фахівці? Для наочності
нижче приведена діаграма, чітко показує
популярність і используемость відомих
мов програмування в різні роки. </SPAN></FONT>",
"l414" => "<FONT SIZE=4><SPAN>Розглянемо деякі з
них більш докладно. </SPAN></FONT>",
"l415" => "<FONT SIZE=4><SPAN><b>Java(вимовляється Джава;
інколи Ява)</b> - об'єктно-орієнтована мова
програмування, створена компанією
SunMicrosystems у 1995 році як основний компонент
платформи Java. Зараз мовою займається
компанія ORacle, яка придбала SunMicrosystems в
2009 році. Синтаксис мови схожий на С і
С++. </SPAN></FONT>",
"l416" => "<FONT SIZE=4><SPAN>В офіційному релізі
Java програми компілюються в байт-код,
який при виконанні інтерпретується
виртаульной машиною для конкретної
платформи. При створенні Android(операційної
системи з октритим вихідним кодом)
Google взяли за основу Java. Не дивлячись на
те, що операційна система, побудована
на ядрі Linux, була написана переважно на
C, AndroidSDK використовує Java для розробки
зв'язків для платформи Android. </SPAN></FONT>",
"l417" => "<FONT SIZE=4><SPAN><b>C# (вимовляється Сі-шарп)</b>
- об'єктно-орієнтована мова програмування
з безпечною системою типізації для
платформи .NET. Розроблено Андерсом
Гейлсбергом, Худобою Вилтамуком і
Пітером Гольде під егідою MicrosoftResearch
(при фірмі Microsoft). </SPAN></FONT>",
"l418" => "<FONT SIZE=4><SPAN>Синтаксис C# близький
до C++ і Java. Мова має строгу статичну
типізацію, підтримує поліморфізм,
перевантаження операторів, покажчики
на функції-члени класів, атрибути, події,
властивості, виключення, коментарі у
форматі XML. </SPAN></FONT>",
"l419" => "<FONT SIZE=4><SPAN>Перейнявши багато
чого від своїх попередників - мов C++,
Delphi, Модула(нащадок мови Паскаль) і
Smalltalk — С#, спираючись на практику їх
використання, виключає деякі моделі,
що зарекомендували себе як проблематичні
при розробці прогарммных систем. </SPAN></FONT>",
"l420" => "<FONT SIZE=4><SPAN><b>JavaScript (JS)</b> — динамічний,
об'єктно-орієнтована мова програмування.
Реалізація стандарту ECMAScript. Найчастіше
використовується як частина брауезра,
яка дає можливість коду на стороні
клієнта (такого, який виконується на
пристрої кінцевого користувача)
взаємодіяти з користувачем, управляти
браузером, асинхронно обмінюватися
даними з сервером, змінювати структуру
і зовнішній вигляд веб-сторінки. Мова
JavaScript також використовується для
прогарммирования на стороні сервера(на
зразок таких мов програмування як Java і
C#), розробки ігор стаціонарних і мобільних
додатків, сценаріїв у прикладному
програмному забезпеченні (наприклад,
в програмах зі складу Adobe Creative Suite),
всередині PDF-документів і т. д. </SPAN></FONT>",
"l421" => "<FONT SIZE=4><SPAN><b>PHP (англ. PHP: Hypertext
Preprocessor — PHP: гіпертекстовий процесор)</b>,
попередня назва: Personal Home Page Tools — скриптова
мова програмування, була створена для
генерації HTML-сторінок на стороні
веб-сервера. PHP є однією з найпоширеніших
мов, що використовується в сфері
веб-розробок(разом із Java, .NET, Perl, Python,
Ruby). PHP підтримується більшістю
хостинг-провайдерів. PHP - проект відкритого
програмного забезпечення. </SPAN></FONT>",
"l422" => "<FONT SIZE=4><SPAN>PHP інтерпретується
веб-сервером в HTML-код, який передається
на сторону клієнта. На відміну від
скриптової мови JavaScript, користувач не
бачить PHP-код, тому що браузер отримує
готовий html-код. Це перевага з точки зору
безпеки, але погіршує інтерактивність
сторінок. Однак ніщо не забороняє
використовувати рнр для генерування і
JavaScript-кодів, які виконуються вже на
стороні клієнта. </SPAN></FONT>",
"l423" => "<FONT SIZE=4><SPAN>Крім безпосередньо
розробників IT-сфері потрібні й інші
фахівці – <i>тестувальники, бізнес-аналітики,
DevOps-фахівці, архітектори, менеджери.</i></SPAN></FONT>",
"l424" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
QAengineer</b></SPAN></FONT>",
"l425" => "<FONT SIZE=4><SPAN>Професія цих фахівців
молода і все ще знаходиться на стадії
формування (особливо в Україні). </SPAN></FONT>",
"l426" => "<FONT SIZE=4><SPAN>Quality Assurance engineer — це
спеціаліст з забезпечення якості,
діяльність якого спрямована на поліпшення
процесу розробки ПЗ, запобігання дефектів
і виявлення помилок в роботі продукту.
</SPAN></FONT>",
"l427" => "<FONT SIZE=4><SPAN>Основне завдання QA —
забезпечення якості. QA-інженер фокусує
увагу на процесах розробки, покращує
їх, запобігає появі дефектів і проблем
(Makes sure you are doing the right things, the right way). </SPAN></FONT>",
"l428" => "<FONT SIZE=4><SPAN>Процес забезпечення
якості складається з таких етапів: </SPAN></FONT>",
"l429" => "— <FONT SIZE=4><SPAN>перевірка вимог до
продукту;</SPAN></FONT>",
"l430" => "— <FONT SIZE=4><SPAN>оцінка ризиків;</SPAN></FONT>",
"l431" => "— <FONT SIZE=4><SPAN>планування ідей
щодо поліпшення якості продукту;</SPAN></FONT>",
"l432" => "— <FONT SIZE=4><SPAN>планування тестування;</SPAN></FONT>",
"l433" => "— <FONT SIZE=4><SPAN>аналіз результатів
тестування;</SPAN></FONT>",
"l434" => "<FONT SIZE=4><SPAN>Всередині процесу QA
виділяють процес Quality Control — контроль
якості продукту. QC-фахівці аналізують
результати тестування і відповідають
за виявлення та знищення дефектів в
продукті (Makes sure the results of what you have doneis what
you expected). </SPAN></FONT>",
"l435" => "<FONT SIZE=4><SPAN>Ще більш вузька
спеціальність в рамках QA/QC — тестувальник
ПЗ, який перевіряє готовий продукт на
наявність помилок (багів) та невідповідність
вимогам, і потім документує знайдені
дефекти та шляхи їх відтворення.
Тестування — це один з етапів забезпечення
і контролю якості. </SPAN></FONT>",
"l436" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
DevOps engineer</b></SPAN></FONT>",
"l437" => "<FONT SIZE=4><SPAN>DevOps engineer — такі фахівці
працюють на стику областей розробки і
системного адміністрування, забезпечуючи
ефективність процесу постачання. </SPAN></FONT>",
"l438" => "<FONT SIZE=4><SPAN><b>DevOps (development + operations)</b> —
це зародилася в 2009 році методологія,
націлена на взаємодію програмістів і
системних адміністраторів для збільшення
частоти випуску релізів. Відповідно,
DevOps engineer — фахівець, який працює на
стику цих двох посад і займається
автоматизацією життєвого циклу програми
(включаючи проектування, розробку,
тестування, розгортання, підтримку та
моніторинг). </SPAN></FONT>",
"l439" => "<FONT SIZE=4><SPAN>Головна завданням
DevOps інженера — максимально збільшити
передбачуваність, ефективність і безпеку
розробки ПО. </SPAN></FONT>",
"l440" => "<FONT SIZE=4><SPAN>Якщо розглядати повний
життєвий цикл ПЗ, то на етапі оцінки
DevOps фахівці отримують первинну інформацію
про необхідність нового кодування та
внесення змін в ІТ-інфраструктуру. На
етапі проектування — визначають вимоги
до інфраструктури. На етапі розробки і
тестування — займаються розгортанням
продукту, а також підтримкою засобів
для розробки, інтеграційних та
навантажувальних тестуванням ПЗ для
перевірки готовності операційного
середовища. </SPAN></FONT>",
"l441" => "<FONT SIZE=4><SPAN>Основна частина роботи
DevOps інженера припадає на етап випуску
релізу — постачання продукту замовнику.
В центрі уваги знаходиться продуктивність
всіх потоків процесу доставки. Такий
фахівець стежить за тим, щоб відомі баги
ніколи не передавалися на наступний
етап робіт, ніколи не розвивалася
локальна оптимізація, призводить до
створення глобальної деградації. </SPAN></FONT>",
"l442" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
посада Бізнес-аналітик</b></SPAN></FONT>",
"l443" => "<FONT SIZE=4><SPAN>Мова піде про
бізнес-аналітиці, який виконує роль
сполучної ланки між замовником і
розробниками. </SPAN></FONT>",
"l444" => "<FONT SIZE=4><SPAN>Бізнес-аналітик — це
фахівець, який досліджує проблему
замовника, шукає рішення і оформлює
його концепцію в формі вимог, на які в
подальшому будуть орієнтуватися
розробники при створенні продукту. </SPAN></FONT>",
"l445" => "<FONT SIZE=4><SPAN>Головне завдання
бізнес-аналітика — виявити проблеми
бізнесу замовника і знайти максимально
ефективне рішення. Для цього він повинен
володіти знаннями в предметної області.
Бізнес-аналітик працює з вимогами на
всіх етапах життєвого циклу розробки
ПЗ і постійно виступає посередником
між замовником і командою програмістів.
</SPAN></FONT>",
"l446" => "<FONT SIZE=4><SPAN>Робота бізнес-аналітика
включає такі етапи:</SPAN></FONT>",
"l447" => "<FONT SIZE=4><SPAN>1. Виявити потреби
замовника, зрозуміти проблему, яку він
хоче вирішити. </SPAN></FONT>",
"l448" => "<FONT SIZE=4><SPAN>2. Самостійно або за
допомогою команди сформулювати концепцію
рішення. </SPAN></FONT>",
"l449" => "<FONT SIZE=4><SPAN>3. Оформити концепцію
в технічне завдання з конкретними
вимогами до майбутнього продукту. Для
цього використовуються різні техніки
бізнес-аналізу — побудова моделей
процесів і структур, прототипи
користувальницького інтерфейсу, сценарії
використання. В цей же час робиться
точна оцінка трудовитрат і тривалості
робіт. </SPAN></FONT>",
"l450" => "<FONT SIZE=4><SPAN>4. Деталізувати кожну
вимогу у вигляді специфікацій. </SPAN></FONT>",
"l451" => "<FONT SIZE=4><SPAN>5. Консультувати
програмістів та тестувальників під час
розробки продукту, спірні моменти
обговорювати з замовником. </SPAN></FONT>",
"l452" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада QA
Automation engineer</b></SPAN></FONT>",
"l453" => "<FONT SIZE=4><SPAN>QA Automation engineer — це
спеціаліст з забезпечення якості
продукту, який використовує програмні
засоби для створення тестів та перевірки
результатів виконання. </SPAN></FONT>",
"l454" => "<FONT SIZE=4><SPAN>Основне завдання
QA-автоматизатора — створювати автоматичні
скрипти, які будуть перевіряти роботу
програми на підставі тест-кейсів,
написаних QA-мануальщиками. Це допомагає
скоротити час тестування і спростити
його процес. </SPAN></FONT>",
"l455" => "<FONT SIZE=4><SPAN>QA Automationengineer володіє
навичками програміста і логікою
тестувальника одночасно: </SPAN></FONT>",
"l456" => "— <FONT SIZE=4><SPAN>Як і QA-інженери або
тестувальники, QA-автоматизатормониторит
якість продукту на різних етапах його
розробки, тестування та експлуатації.</SPAN></FONT>",
"l457" => "— <FONT SIZE=4><SPAN>Як і програмісти,
QA-автоматизатор займається розробкою,
тільки він створює продукт, щоб перевірити
написане програмістами.</SPAN></FONT>",
"l458" => "<FONT SIZE=4><SPAN>Іншими словами,
програмісти створюють, тестувальники
— ламають, а автоматизаторы — створюють,
щоб зламати. </SPAN></FONT>",
"l459" => "<FONT SIZE=4><SPAN>В ролі замовника для
автоматизатора виступає тестувальник,
який тестує вручну. Він просить
автоматизувати той чи інший шматок
функціональності, щоб більше не
повторювати одні і ті ж рутинні дії і
звільнити час на аналіз і придумування
нетривіальних сценаріїв. Таким чином,
автоматизатор створює продукт, кінцевим
користувачем якого буде він сам і його
команда. </SPAN></FONT>",
"l460" => "<FONT SIZE=4><SPAN>Автоматизація доцільна
лише в тому випадку, якщо час і ресурси,
витрачені на її реалізацію та підтримку,
не перевищують передбачуваних витрат
часу і ресурсів, необхідних для ручного
тестування тієї ж функціональності.</SPAN></FONT>",
"l461" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
Technical Writer</b></SPAN></FONT>",
"l462" => "<FONT SIZE=4><SPAN>Технічний письменник
— це фахівець, який складає технічну
документацію (інструкції з експлуатації
для користувачів, ТЗ для розробників і
т. д.) на всілякі програми і автоматизовані
системи. </SPAN></FONT>",
"l463" => "<FONT SIZE=4><SPAN>Основне завдання
TechnicalWriter — грамотно створювати,
ілюструвати і адаптувати документацію
на зрозумілій для кінцевого користувача
мовою. Матеріал може призначатися для
потреб команди/проекту (внутрішня) або
для клієнта продукту (зовнішня). </SPAN></FONT>",
"l464" => "<FONT SIZE=4><SPAN>Особливості роботи
технічного редактора можуть трохи
відрізнятися в залежності від поставленої
задачі: </SPAN></FONT>",
"l465" => "— <FONT SIZE=4><SPAN>Якщо цей фахівець
працює над матеріалом «від розробника
— клієнту», то спочатку він вивчає
існуюче, а потім, розібравшись, пише
інструкції для кінцевого користувача.</SPAN></FONT>",
"l466" => "— <FONT SIZE=4><SPAN>Якщо в роботі матеріал
«від клієнта до розробника», то технічний
письменник разом з бізнес-аналітиком
оцінює потреби клієнта, і потім доносить
це до розробників у зрозумілій для них
формі у вигляді специфікації або
технічного завдання.</SPAN></FONT>",
"l467" => "<FONT SIZE=4><SPAN>Technical Writer зобов'язаний
володіти глибокими знаннями в тій
області, про яку пише, і вміти виражати
суть максимально докладно і, разом з
тим, лаконічно. Важливо вміти працювати
з ілюстраціями — робити і обробляти
скріншоти, створювати зрозумілі графіки,
схеми, діаграми. Також часто, особливо
для роботи з онлайн-довідкою, необхідно
мати хоча б базові навички HTML. </SPAN></FONT>",
"l468" => "<FONT SIZE=4><SPAN>У коло обов'язків
технічного письменника може входити: </SPAN></FONT>",
"l469" => "— <FONT SIZE=4><SPAN>Створення
користувальницької документації,
довідкових систем;</SPAN></FONT>",
"l470" => "— <FONT SIZE=4><SPAN>Створення документації
для адміністраторів систем;</SPAN></FONT>",
"l471" => "— <FONT SIZE=4><SPAN>Підготовка графічних
схем за заданими параметрами;</SPAN></FONT>",
"l472" => "— <FONT SIZE=4><SPAN>Регулярне оновлення
вже існуючої документації у відповідності
з релізами;</SPAN></FONT>",
"l473" => "— <FONT SIZE=4><SPAN>Створення навчальних
матеріалів для нових користувачів.</SPAN></FONT>",
"l474" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
Project Manager</b></SPAN></FONT>",
"l475" => "<FONT SIZE=4><SPAN>Project Manager — це фахівець,
чиєю головною завданням є управління
проектом в цілому: проектування і
розстановка пріоритетів, планування
виконання завдань, контроль, комунікації,
а також оперативне вирішення проблем.
</SPAN></FONT>",
"l476" => "<FONT SIZE=4><SPAN>Основна обов'язок і
відповідальність PM — довести ідею
замовника до реалізації у встановлений
термін, використовуючи існуючі ресурси.
В рамках цієї задачі PM'у необхідно
побудувати план розробки, організувати
команду, налаштувати процес роботи над
проектом, забезпечити зворотний зв'язок
між командами і замовником, усувати
перешкоди для команд, контролювати
якість і поставку продукту в строк. </SPAN></FONT>",
"l477" => "<FONT SIZE=4><SPAN>Завдання PM'а можна
класифікувати як тактичні і стратегічні.
Тактичні — це вирішення щоденних проблем
проекту, усунення перешкод на шляху
команди. Стратегічні полягають у тому,
щоб координувати спільну мету проекту,
шлях до неї, а також швидкість пересування.
</SPAN></FONT>",
"l478" => "<FONT SIZE=4><SPAN>З іншого боку, завдання
PM'а можна об'єднати в 3 групи: </SPAN></FONT>",
"l479" => "— <FONT SIZE=4><SPAN>досягнення цілей
проекту і клієнта (ефективне виконання
завдання, забезпечення високого рівня
задоволеності клієнта);</SPAN></FONT>",
"l480" => "— <FONT SIZE=4><SPAN>досягнення цілей
начальства і компанії (фінансові
показники);</SPAN></FONT>",
"l481" => "— <FONT SIZE=4><SPAN>досягнення цілей
членів команди (мотивація, допомога в
реалізації кар'єрних цілей, запобігання
конфліктів).</SPAN></FONT>",
"l482" => "<FONT SIZE=4><SPAN>«Головна постановка
задачі для PM'а: &quot;Нам потрібно, щоб це
працювало&quot;, що передбачає, що команда
надасть результат в розумні терміни з
розумним рівнем якості». </SPAN></FONT>",
"l483" => "<FONT SIZE=4><SPAN><b>Кар'єра в IT: посада
Software Architect</b></SPAN></FONT>",
"l484" => "<FONT SIZE=4><SPAN>У цій частині обговоримо
вищу сходинку безпосередньо программистской
кар'єри в IT — SoftwareArchitect. </SPAN></FONT>",
"l485" => "<FONT SIZE=4><SPAN>SoftwareArchitect — це
IT-фахівець, який приймає рішення щодо
внутрішнього устрою і зовнішніх
інтерфейсів програмного комплексу з
урахуванням проектних вимог і наявних
ресурсів. </SPAN></FONT>",
"l486" => "<FONT SIZE=4><SPAN>Головне завдання
архітектора — пошук оптимальних
(простих, зручних, дешевих) рішень, які
будуть максимально відповідати потребам
замовника і можливостям команди. На
підставі бізнес-вимог цей фахівець
створює функціональну та технічну
специфікацію системи, планує та розробляє
способи технічної реалізації, обирає
технології. </SPAN></FONT>",
"l487" => "<FONT SIZE=4><SPAN>Архітектор зобов'язаний
мати цілісне бачення всієї системи і
грамотно визначати, як система буде
розбито на модулі, і як ці модулі будуть
взаємодіяти між собою, — тільки після
прийняття цих рішень команда розробників
зможе приступити до роботи над окремими
модулями. </SPAN></FONT>",
"l488" => "<FONT SIZE=4><SPAN>«Архітектор ЗА нічим
не відрізняються від інших Архітекторів,
які будують мости або будинку. Додаток
— це теж будова: йому потрібен правильний
фундамент і сильні рішення. Стоячи під
мостом під час перевірки навантаженням,
потрібно бути впевненим, що він не
впаде». Необхідно стратегічне бачення:
проектні рішення архітектора повинні
забезпечувати можливість коректних
змін або покращень системи, її подальшого
розширення, створення наступних версій,
а також можливість повторного використання
коду в інших проектах. </SPAN></FONT>",
"l489" => "<FONT SIZE=4><SPAN>«На відміну від
проектного менеджера, який фокусується
на питанні, як успішно довести проект
до кінця в рамках поточних бюджетів і
ресурсів, архітектор відповідає за те,
як технічно правильно довести проект
до кінця в рамках поточних ресурсів і
не застрелитися при розробці наступних
версій». </SPAN></FONT>",
"l490" => "<FONT SIZE=4><SPAN>Крім цього, від
архітектора очікується глибоке розуміння
предметної області бізнесу, знання
основних стандартів та трендів, пов'язаних
з даним продуктом. Або, якщо від
протилежного, — незнання спеціалістом
будь-якої бізнес-деталей, необхідних
для проектування, не може служити
виправданням нездатності архітектора
виконати свою роботу. </SPAN></FONT>",
"l491" => "<FONT SIZE=4><SPAN>Ну от і розібралися з
тим, чим же займаються IT-фахівці і,
власне, які вони бувають. </SPAN></FONT>",
"l492" => "<FONT SIZE=4><SPAN>
<i>Лекцію підготувала<br>
викладач кафедри КМПС<br>
Коритко Юлія Миколаївна.</i>
</SPAN></FONT>",
//////////////////////////////////////////////////////////////Лекция 5
"l50" => "Лекція №5",
"l51" => "<B>Что такое программирование?</B>",
"l52" => "<B>Введение</B>",
"l53" => "Сегодня большинству
из нас нет необходимости понимать, как
устроена и разработана техника. Многие
являются уверенными пользователями
мобильных телефонов, планшетов, ноутбуков
и компьютеров, но лишь малая часть
интересуется и понимает, как именно
девайс отвечает на действия и выполняет
запросы пользователя. ",
"l54" => "Программирование является не просто
специальностью, профессией или увлечением,
программирование — это страсть и желание
всегда узнавать новое, разбираться в
деталях, простых и сложных понятиях,
уметь общаться с техникой на ее языке.",
"l55" => "Общими словами программирование или
написание программного обеспечения
можно описать как реализацию алгоритмов,
процессов и процедур.",
"l56" => "<b>Процесс</b> — ряд действий или шагов,
предпринятых для достижения цели.",
"l57" => "<b>Процедура</b> — ряд действий, выполняемых
в определенном порядке.",
"l58" => "<b>Алгоритм</b> — упорядоченный набор шагов
для решения задачи.",
"l59" => "Можно видеть, что все три определения
похожи между собой и в то же время
отличаются. Программирование включает
в себя разработку списков инструкций
— представление исходного кода
программного обеспечения. Эти инструкции
и команды манипулируют различными
типами объектов, в частности, числами,
словами, изображениями, звуками и тд.
Создание программного обеспечения
может быть как сочинение музыки, как
разработка дизайна дома, как создание
огромного количества вещей. Всегда
будут споры о том, что программирование
— это искусство, а не механический
инжиниринг. ",
"l510" => "Важной причиной того, что необходимо
учиться программировать, является то,
что понятия, лежащие в основе этого,
будут ценными для вас не зависимо от
того, станет ли программирование вашей
профессией или карьерой. Одна из вещей,
которую вы узнаете очень быстро, что
программируемый девайс — достаточно
тупой, но послушный. Он делает именно
то, что вы хотите. Программирование
также даст вам возможность узнать
важность ясности и прямоты выражения
команд и желаний.",
"l511" => "Кроме того программирование — это
<b>весело.</b> ",
"l512" => "<B>Программирование, используя
разговорный язык</B>",
"l513" => "Написание программного обеспечения —
это в большинстве случаев написание
шагов для выполнения какой-либо задачи.",
"l514" => "Прежде чем начать
изучать языки программирования,
необходимо понять, как правильно
составлять шаги и инструкции. Есть
упражнение &quot;computer programming sandwich&quot; (2,
3), согласно которому задача описана
следующим образом:",
"l515" => "Исходные данные: Студенты должны описать
конкретные и последовательные шаги
приготовления сэндвича.",
"l516" => "Выполнение: Студенты
вне аудитории пишут очень подробный и
детализированный рецепт приготовления
сэндвича шаг за шагом. Затем каждый из
студентов зачитывает (вводит) шаги
своего рецепта (алгоритма) лектору (в
компьютер). Лектор (компьютер) строго
выполняет (собирает, компилирует и
выполняет) программу, согласно инструкциям
(алгоритму) студента. ",
"l517" => "Такое упражнение с корректировками
алгоритмов от лектора очень хорошо
показывает суть программирования и
важность точного, аккуратного и ясного
формулирования каждого шага при написании
программного обеспечения.",
"l518" => "<B>Программирование с использованием
среды блоков</B>",
"l519" => "Около 15 лет назад,
Митчел Резник (4) и команда MIT (5) представили
среду Scratch (6). Она представляет собой
новый подход в изучении программирования
через графический пользовательский
интерфейс, который позволяет избежать
многих ошибок, как при текстовом
программировании.",
"l520" => "Рис. 1. Среда блоков
Scratch",
"l521" => "Программное обеспечение построено с
помощью соединяющихся блоков, каждый
из которых представляет некоторую
функциональность, доступную в систем.
Рисунок 1 показывает простую программу,
которая просит пользователя запустить
ее, спросить имя и затем вывести Hello.
Цвет используется для категорий, которым
принадлежат блоки. Форма блоков
определяет, куда они могут быть помещены,
чтобы сформировать цельную и приемлемую
программу.",
"l522" => "Программирование с использованием
среды блоков является простым и хорошим
стартом для новичков в программировании.",
"l523" => "<B>Языки программирования высокого
уровня</B>",
"l524" => "Разработка большинства
программного обеспечения в настоящее
время осуществляется с помощью языков
программирования высокого уровня.
Многим из них более 50ти лет: COBOL, FORTRAN,
Lisp. Высокоуровневые языки позволяют
создавать части программ легче. Они
позволяют абстрагироваться от специфики
процессора вашего компьютера и
сконцентрироваться на выполнении
задачи, а не на том, как представить
программу на конкретной архитектуре.
Кроме того все высокоуровневые языки
сопровождаются библиотеками — большим
набором функциональности, которую вам
не нужно реализовывать, а только
использовать.",
"l525" => "Более молодыми
высокоуровневыми языками являются
C-like языки: C++, C#, Java, Objective-C, Swift и тд. Эти
языки основаны на не объектно-ориентированном
языке программирования С&nbsp;(7). C - (рус.
Си) — компилируемый статически
типизированный язык программирования
общего назначения, разработанный в
1969—1973 годах сотрудником Bell Labs Деннисом
Ритчи как развитие языка Би. ",
"l526" => "Несколько примеров
в этой лекции будут приведены на языке
Java (8). Язык появился в 1995 одновременно
с широким распространением интернета
среди пользователей. Изобретен Джеймсом
Гослингом из компании Sun Microsystems. Одним
из больших преимуществ Java является
наличие библиотек (уже разработанного
функционала), позволяющих писать
программы со сложными графическими
пользовательскими интерфейсами, которые
обмениваются данными через Интернет.
Java используется в разнообразных
приложениях, от мобильных телефонов до
обработки баз данных через Интернет.
Java также используется для написания
приложений для Android.",
"l527" => "Простейший пример программы, которая
выводит приветствие.",
"l528" => "<FONT SIZE=3><B>PRINT — </B></FONT>это
команда, которая отображает (выводит
на экран) содержимое, переданное в
скобках.",
"l529" => "Приведем
пример программы, которая находит и
выводит на экран минимальное число
среди набора из нескольких чисел.",
"l530" => "Приведенные
простейшие примеры показывают, что
высокоуровневые языки похожи на
специфический набор команд (предложений)
из слов английского языка, чисел,
операторов и скобок. ",
"l531" => "Однако специальная программа
интерпретирует приведенный выше код в
машинный язык, который «понятен»
компьютеру. К машинному языку наиболее
близки языки низкого уровня.",
"l532" => "Языки программирования низкого
уровня — язык ASSEMBLER",
"l533" => "Одним из абстрактных уровней
приближающих к машинному языку является
язык Ассемблера. В языке ассемблера все
представлено в виде понятном человеку
— символических именах. Программист
работает с операциями, которые понятны
микропроцессору и он знает, как их
выполнять. Объекты в микропроцессоре
и адреса в памяти компьютера представлены
символическими именами. Команды на
языке ассемблера обращаются напрямую
к микропроцессору, и такие алгоритмические
программы все еще разрабатываются и
используются в некоторых узких областях.",
"l534" => "Рис. 2. Поиск максимального числа из
набора на языке ассемблера",
"l535" => "Таким образом, как
можно видеть, высокоуровневый язык
близок по функциональности к низкоуровневым,
но ближе по форме и структуре к английскому.
Помимо более крупных отличий, которые
вы изучите позже, у языка ассемблера
есть недостаток — он очень зависим от
архитектуры микропроцессора и операционной
системы компьютера, тогда как
высокоуровневые языки — независимы.",
"l536" => "Заключение",
"l537" => "Программирование —
это процесс создания набора инструкций
для компьютера, мобильного девайса или
других электронных приборов для
выполнения определенных задач. Наиболее
распространены в настоящее время языки
программирования высокого уровня,
которые платформо- и архитектурнонезависимы.
Язык программирования определяет
специфику составления инструкций. ",
"l538" => "Все что вы видите на
экране ваших ноутбуков, компьютеров,
планшетов, мобильных телефонов, часов,
электронных книг, игровых приставок
разработано с помощью языков
программирования. Все действия, на
которые отвечают ваши технические
девайсы — это результат обработки их
программным обеспечением, которое
позволяет задать алгоритмы и «объяснить»
технике, что вы хотите получить.",
"l539" => "В ходе обучения программированию вы
научитесь самостоятельно создавать
программное обеспечение, не уступающее
уже существующему.",
"l540" => "Источники:",
"l541" => "",
"l542" => "",
////////////////////////////////////////////////////////////////////////////Заключение
"c0" => "Висновок",
"c1" => "",
"c2" => "Кафедра «Комп'ютерне моделювання процесів і
систем»<br>Інженерно-фізичного
факультету",
"c3" => "Національного
технічного університету",
"c4" => "«Харківський
політехнічний інститут»",
"c5" => "Навколишній
світ, техніка і технології навколо нас
в останні десятиріччя змінюються з
шаленою швидкістю. Старе освіта,
побудована на заучуванні певних знань
з конкретних технічних питань, виявляється
неконкурентними в нашу епоху.",
"c6" => "Перед
вами стоїть один з найважливіших виборів
у житті – вибір життєвого шляху, для
успіху в якому необхідно класичне,
фундаментальну освіту. ",
"c7" => "У
всьому світі відомо, що вибирати треба
класичну освіту в вузах, що мають
багаторічний досвід наукової та освітньої
діяльності, таких як наш Політехнічний.",
"c8" => "Пропонуємо
вам отримати освіту інноваційного типу,
модель якого вже протягом 85 років
використовується на інженерно-фізичному
факультеті НТУ «ХПІ». Створена засновниками
факультету, всесвітньо відомими
академіками Л. Д. Ландау, В. В. Обреімовим,
А. П. Філіпповим та багатьма іншими для
її застосування в фізиці і механіці, в
60-ті роки вона була з успіхом використана
для створення досконалої нової,
«космічної» спеціальності, яка зараз
носить назву «Прикладна математика».
Фахівці, які отримали на ній освіту з
математики і інформаційних технологій,
стали творцями передової техніки в
радянській космонавтиці, атомній
енергетиці і на транспорті.",
"c9" => "Науковці
інженерно-фізичного факультету вперше
в ХПІ застосували ЕОМ у навчальному
процесі і в наукових дослідженнях в
кінці 50х років минулого століття. З тих
пір програмування та відповідні
математичні методи є базовим напрямком
освіти всіх спеціальностей факультету.",
"c10" => "В
даний час на кафедрі «Комп'ютерне
моделювання процесів і систем» йде
підготовка за двома спеціальностями:
«Прикладна математика» та «Комп'ютерні
науки та інформаційні технології».
Обидві вони готують фахівців, які
володіють знаннями сучасної математики
і інформаційних технологій. Велике
місце в освіті приділяється також
інженерних знань, без яких немислимий
сьогоднішній фахівець.",
"c11" => "Освіта
на всіх спеціальностях інфізу, в тому
числі і на наших спеціалізацій «Комп'ютерне
моделювання процесів і систем» та
«Проектування, створення та аналіз
комп'ютерних систем», побудовано на
використанні основної парадигми освіти
– поєднання навчання і науково-технічної
роботи студентів разом з викладачами
по створенню сучасних систем управління
в авіа-космічної техніки, цифрової
телефонії та мобільного зв'язку. На
кафедрі старанно підтримується ця
основа інфізівської системи освіти –
ми вважаємо, що найкраще людина може
навчитися новому, безпосередньо беручи
участь у творчих процесах наукового
або технічного творення. На третьому
курсі студент обирає майбутнє напрямок
своєї діяльності – науку, інженерна
справа або інформаційні технології,
вибирає групу вчених і інженерів кафедри,
в якій він буде продовжувати свою освіту
аж до захисту магістерської роботи на
6м курсі. Працюючи спочатку над
дослідницькими курсовими, а потім і
дипломними роботами, під керівництвом
професорів - вчених світового класу,
студент отримує знання не тільки
традиційно «вертикально» - на заняттях,
але і «горизонтально» - спілкуючись у
своїй дослідницькій групі зі студентами
старших курсів, аспірантами і викладачами.",
"c12" => "Вже
до захисту бакалаврського диплома у
наших студентів готові реальні розробки,
які вони можуть показати в майбутньому
своїм роботодавцям. Ці роботи часто
мають реальну цінність – розроблені
програми впроваджуються у практику
проектування великих проектних
організацій і комп'ютерних фірм. Для
прикладу наведемо деякі з них.",
"c13" => "Студентами
кафедри – математиками і информатиками
розроблена Система автоматизованого
комп'ютерного проектування навігаційних
пристроїв для малої авіації та інших
транспортних засобів. Програма «SanaCAD»
дозволяє користувачеві в діалоговому
режимі проектувати системи управління
та навігаційні пристрої з використанням
унікальних математичних моделей,
створених науковцями кафедри. ",
"c14" => "Студентами
4-5х курсів на заняттях з предмету «Вибір
та архітектура програмних рішень» при
роботі у формі захоплюючої рольової
гри створена «Система обліку знань» -
web-додаток, що дозволяє в інтерактивному
режимі контролювати знання учнів. При
роботі всі студенти розподіляються для
виконання ролей – менеджера, програмістів,
тестувальників, технічних письменників
та інших, контролюють один одного,
домагаючись ефективної та злагодженої
роботи, купуючи важливий досвід командної
розробки. ",
"c15" => "За
останні роки на кафедрі розроблена
система управління рухом міні-дирижабля,
виготовлення якого має початися цим
летом, і у вас, як майбутніх наших
студентів, буде реальна можливість
взяти участь у роботі.",
"c16" => "Однією
зі спеціалізацій кафедри є розробка
програмного забезпечення для мобільних
телефонів під операційні системи ",
"c17" => "Android",
"c18" => "iOS",
"c19" => "та ",
"c20" => "- починаючи від алгоритмів керування
безпілотними літальними апаратами до
комп'ютерних ігор.",
"c21" => "Перелік
цей можна продовжувати, більше ви можете
дізнатися на Дні відкритих дверей на
нашій кафедрі.",
"c22" => "Роботи
науковців кафедри відомі не тільки в
Україні, але і за кордоном. Провідні
науковці кафедри підтримують контакти
з університетами Німеччини, Китаю,
Польщі, Італії, Канади та інших країн.
Студенти, що виявили себе у науковій та
інженерній роботі, мають можливість
брати участь у спільних проектах під
час навчання на старших курсах у німецьких
університетах Аахена і Магдебурга. У
2014 році підписаний договір між кафедрою
та відповідною кафедрою Магдебурзького
університету, що включає обміни аспірантів
і студентів. Також є можливість продовження
освіти в аспірантурі в рамках спільних
наукових робіт в університетах більшості
зазначених країн після закінчення
навчання у нас на кафедрі.",
"c23" => "Про
рівень освіти на спеціальностях кафедри
кажуть перемоги наших студентів на
Всеукраїнських конкурсах наукових
робіт. Протягом останніх трьох років
наші студенти займали перше місце на
конкурсі з математики, призові місця
на конкурсах з кібернетики,
авіаційно-космічній техніці та інших.",
"c24" => "Вчорашні
випускники школи після п'яти-шести років
навчання на кафедрі комп'ютерного
моделювання процесів і систем стають
інженерами-програмістами,
інженерами-математиками в сучасних
ІТ-фірми. В основному у Харкові – це
фірми з західним капіталом, що працюють
на світовий ринок. Кафедра &quot;Комп'ютерне
моделювання процесів і систем&quot;
співпрацює з великими фірмами, що
виробляють у Харкові програмне
забезпечення, такими як &quot;DataArt&quot;,
&quot;Miratech&quot;, &quot;Nixsolutions&quot; та іншими,
співробітники цих фірм є викладачами
кафедри. Студенти мають можливість
проходити практику і виконувати курсові
роботи під керівництвом провідних
фахівців, а після закінчення вузу –
вступити на досить високооплачувану
роботу. Детальніше про працевлаштування
і місцях роботи наших випускників можна
почитати в нашій групі Вконтакте, досить
багато випускників працює у великих
українських та зарубіжних компаніях,
основні з них перераховані нижче.",
"c25" => "Компанія",
"c26" => "NIX
Solutions",
"c27" => "була заснована в 1994 році і до теперішнього
часу перетворилася в одного з найбільших
флагманів IT-аутсорсингу в Україні з
серйозним портфелем виконаних проектів
за плечима. Багата історія, міцні
традиції, інноваційний комплексний
підхід до вирішення завдань клієнтів
і реальна турбота про їхній бізнес є
основою успіху компанії і дозволяють
їй динамічно розвиватися, постійно
розширюючи перелік надаваних послуг і
підвищуючи їх якість.",
"c28" => "Все
різноманіття послуг, що надаються
компанією, можна розділити на кілька
напрямів. Довгий час однією з основних
сфер діяльності NIX Solutions була розробка
ПЗ на замовлення. Пізніше акцент став
зміщуватися у бік підтримки існуючого
ПЗ, і зараз ці два напрями приблизно
однакові за обсягом і разом складають
близько 90% всіх замовлень компанії.
Решта 10% діляться між віддаленим
адмініструванням і технічною підтримкою
та консультаційними послугами, які були
включені в перелік відносно недавно.",
"c29" => "Окремим
напрямком роботи компанії є розробка
власних продуктів. Це напрямок на даний
момент є швидше прикладним і розвивається
в основному в рамках роботи над великими
проектами або паралельно з інноваційними
дослідженнями. Результатом діяльності
в цьому напрямку стала серія додатків
для iPhone, їх аналоги для Android і деякі
конкретні програми.",
"c30" => "Одним
з ключових переваг компанії перед
конкурентами є широкий охоплення
платформ розробки. У структурі NIX
Solutions створені і успішно функціонують
відділи розробки PHP, .NET, Java, C++, Flash, CMS,
iPhone/Android. Якість випущених продуктів та
надаваних послуг забезпечує найбільший
на даний момент відділ QA. Така різнобічність
у поєднанні з багатим досвідом розробки
дозволяє братися за комплексні
мультиплатформенні проекти та успішно
їх виконувати.",
"c31" => "Міратех",
"c32" => "– провідний постачальник ІТ аутсорсинга,
заснований в 1989 році, зі штаб-квартирами
в р. Стокгольм, Швеція і Вашингтон, США;
а також 6 центрами розробок у Польщі,
Словаччині та Україні.",
"c33" => "Присутній
в ключових галузевих рейтингах: Global
Services 100, Global Outsourcing 100, Software 500, NOA's Outsourcing
Professional Award; EOA Award; входитв Best 5 Companies in
Eastern Europe за версією IAOP.",
"c34" => "Кількість
співробітників - 870 осіб, станом на 1
січня 2015 року. Контракти з замовниками
зазвичай укладаються на термін більше
п'яти років.",
"c35" => "Завдяки
унікальному поєднанню багаторічного
досвіду, видатного технічного та
інженерного потенціалу, глибокого
знання особливостей реалізації
міжнародних проектів, а також досвіду
в оптимізації ланцюжка створення доданої
вартості, Міратех є надійним партнером
як для середнього бізнесу, так і для
підрозділів великих транснаціональних
компаній. Міратех – сервісно-орієнтована
компанія, яка при розробці технологічних
рішень та організації бізнес-процесів
ставить у главу кута потреби своїх
клієнтів, що дозволяє їм фінансувати
проекти, пов'язані з залученням зовнішніх
ресурсів без шкоди для якості надаваних
послуг.",
"c36" => "Володіючи
можливістю залучати до проектів
талановитий персонал з Центральної та
Східної Європи, Міратех реалізував
багато проектів у різних галузях по
всьому світу. Щоб забезпечити максимальний
ефект від співпраці, компанія працює з
обмеженим числом замовників, концентруючись
на якості й асортименті наданих їм
послуг. Міратех не тільки надає
кваліфікованих інженерів, компанія
також може організовувати управління
проектами, включаючи проекти високої
складності і проекти зі стислими
термінами реалізації, а також готова
брати на себе контрактні зобов'язання
за рівнем надаваних послуг.",
"c37" => "За
роки роботи з клієнтами з Європи і США
Міратех накопичив багатий досвід
реалізації міжнародних проектів, які
впроваджувалися як на території
замовника, так і у віддаленому режимі.
Дотримуючись правил інформаційної
безпеки США та Європейського союзу, а
також надаючи сервіси з офісів в Польщі
і Словаччини, Міратех забезпечує безпечну
обробку персональних даних клієнтів.",
"c38" => "ПАТ
«ХАРТРОН»",
"c39" => "було створено в 1959 році. До 1991 року ПАТ
«ХАРТРОН» (раніше ОКБ-692, п/я А-7160, КБ
«Електроприладобудування», НВО
«Електроприлад») був найбільшим в СРСР
розробником і виробником систем
управління ракет стратегічного
призначення, ракет-носіїв космічних
апаратів (легкого та середнього класу),
систем управління космічних апаратів
важкого класу. В таких областях як
динаміка польоту, точність наведення,
ракетна мету, створення цифрових систем
керування та програмного забезпечення
розробки велися на світовому рівні і
за багатьма напрямами визначали цей
рівень. З найбільш значущих досягнень
слід відзначити розробку систем
управління ракет SS-18, SS-19, ракети-носія
«Циклон» (найбільш надійні носії у
світі), ракети-носія «Енергія», здатна
виводити на орбіту об'єкти вагою понад
100 тонн, важких космічних апаратів
(модулів станції «Мир» - «Квант»,
«Кристал», «Природа», «Спектр») і
унікальної системи автоматичного
стикування для орбітальних об'єктів,
відпрацьованою на кількох поколіннях
радянських орбітальних станцій.",
"c40" => "Ракети-носії
з системами управління розробки ПАТ
«ХАРТРОН» вивели на орбіту близько 1000
космічних апаратів, у тому числі перший
штучний супутник Землі, виготовлений
в Україні, що поклав початок відліку
супутників серії «Космос». Близько 150
космічних апаратів оснащені СУ розробки
ПАТ «ХАРТРОН».",
"c41" => "В
даний час ПАТ «ХАРТРОН» являє собою
холдингову структуру, до складу якої
входять керуюча компанія, власне ПАТ
«ХАРТРОН», і 10 підприємств, створених
з участю керуючої компанії. Організаційно
ПАТ «ХАРТРОН» підпорядковане Державному
космічному агентству України. Керуюча
компанія ПАТ «ХАРТРОН» є науковою
організацією, що має ліцензію ДКАУ на
виконання робіт у космічній сфері. Крім
виконання робіт по науковій тематиці,
керуюча компанія в інтересах підприємств
ПАТ «ХАРТРОН» здійснює взаємодію з
ДКАУ, міністерствами та відомствами
України, нашими партнерами в країнах
ближнього і далекого зарубіжжя. Ведеться
велика робота з координації робіт
підприємств, пошуку нових замовлень. В
даний час підприємства ПАТ «ХАРТРОН»
працюють в таких сегментах ринку, як
ракетно-космічна галузь, енергетика, в
тому числі атомна, залізничний транспорт.
Ракетно-космічний напрямок в діяльності
ПАТ «ХАРТРОН» є пріоритетним. Підприємство
продовжує займати лідируюче, а в деяких
випадках і монопольне становище на
ринку космічних технологій.",
"c42" => "— міжнародна мережа компаній, які
проектують, розробляють, модернізує і
підтримують IT-рішення. DataArt працює з
клієнтами з фінансової індустрії,
телекому, охорони здоров'я, туризму,
медіа і «інтернету речей». Клієнти
DataArt — компанії з унікальними
бізнес-моделями — знаходяться в США і
Великобританії, а розподілені команди
фахівців — центри розробки в Росії,
Україні, Польщі, Аргентині та Болгарії.",
"c43" => "намагається звести до мінімуму число
посередників між клієнтом і розробниками,
тому фахівці говорять з замовником
прямо, що нетипово для такого бізнесу.",
"c44" => "Компанії
мережі DataArt відрізняє особлива корпоративна
культура: відсутність жорсткої ієрархії,
безглуздою бюрократії, гнучкий графік
роботи, система корпоративного освіти.
Спеціаліст DataArt може переїхати в інший
регіон, де є центр розробки DataArt.",
"c45" => "У
компаніях мережі DataArt хороший компенсаційний
пакет, є можливість скористатися
оплачуваної медичної страховкою і
відпочинком, допомогою при переїзді в
інший офіс.",
"c46" => "Серед
клієнтів ",
"c47" => "— провідні компанії в своїх областях:
Nasdaq, S&amp;P, CollerCapital, BankingUp, OCADO, artnet, Betfair,
Skyscanner, ColletteVacations, Booker, CharlesRiver Laboratories і
сотні інших.",
"c48" => "Підприємство
Хартрон (р. Харків, Україна) спеціалізується
на виконанні всього комплексу робіт з
автоматизованих систем управління
технологічними процесами (АСУ ТП)
промислових підприємств, включаючи
проектування, виготовлення, випробування,
постачання, впровадження і супровід в
експлуатації систем АСУ ТП атомних і
теплових електростанцій, інших промислових
об'єктів. Діяльність Хартрона охоплює
всі етапи життєвого циклу систем.",
"c49" => "Хартрон
 заснований в 1994 році. Системи, розроблені
і виготовлені Хартроном, успішно працюють
на всіх атомних електростанціях України.
Значний обсяг робіт по АСУ ТП виконується
для об'єктів в Україні, Росії, Вірменії,
Чехії, Болгарії, Швеції, США, Іраку та
інших країнах.",
"c50" => "У
Хартроні працюють висококваліфіковані
фахівці з системного аналізу і
проектування, функціонального
проектування, програмного забезпечення,
конструювання електронної апаратури,
виготовлення та випробувань систем і
пристроїв. Загальна чисельність фахівців
- близько 200 осіб.",
"c51" => "– швидко розвивається інноваційна
компанія з розробки програмного
забезпечення та IT-аутсорсингу. Бачення
компанії полягає у створенні інноваційних
інформаційних технологій для задоволення
потреб клієнтів у високотехнологічних
рішеннях. ",
"c52" => "заснований в 1993 році на базі НТУ «ХПІ».
В даний час є інноваційною компанією,
яка успішно поєднує в собі академічну
та бізнес діяльність в різних напрямках
ІТ галузі. Більше 7 років компанія успішно
працює на ринку офшорного програмування,
надаючи послуги замовникам з США,
Ізраїлю, Росії, Норвегії, Німеччини,
Великобританії, України і низки інших
країн. ",
"c53" => "Діяльність
компанії: розробка програмного
забезпечення на замовлення (аутсорс),
створення власних ІТ продуктів, участь
в Open Source проектах, проведення освітніх
семінарів у сфері ІТ, участь у конференціях.",
"c54" => "Висновок підготував<br>
викладач кафедри КМПС<br>
Мєтєлєв Володимир Олександрович.",
"c55" => "",
"c56" => "",
"c57" => "",
///////////////////////////////////////////////
"contacts1" => "Контакти",
"contacts2" => "НАПИШІТЬ НАМ",
"contacts3" => "<font size=3 color='white'>Якщо Ви хочете дізнатися про нашу кафедру більше, відправте нам повідомлення і ми зв'яжемося з Вами найближчим часом.</font>",
"contacts4" => "ЯК НАС ЗНАЙТИ",
"contacts5" => "<font size=3 align='left' color='white'>1 поверх, Математичний корпус <br> вул. Кирпичова, 21 <br> Харків, Україна <br> 61002 <br><br> <strong>Телефон</strong> <br> +380577076454 <br> <strong>Факс</strong> <br> +380577076601</font>",
"contacts6" => "Надіслати E-mail",
"contacts7" => "<font size=4> Ми на зв'язку</font>",
"contacts8" => "Вмережі",
"contacts9" => "",
"contacts10" => "",
"contacts11" => "",
"contacts12" => "",
 );
?>